trv/CL_H100_FW/H100/Project_Headers/mc9s08mp16.h
/* Based on CPU DB MC9S08MP16_48, version 3.00.021 (RegistersPrg V2.32) */
/*
** ###################################################################
**     Filename  : mc9s08mp16.h
**     Processor : MC9S08MP16VLF
**     FileFormat: V2.32
**     DataSheet : MC9S08MP16 Rev. 1 09/2009
**     Compiler  : CodeWarrior compiler
**     Date/Time : 5.10.2010, 13:54
**     Abstract  :
**         This header implements the mapping of I/O devices.
**
**     Copyright : 1997 - 2010 Freescale Semiconductor, Inc. All Rights Reserved.
**     
**     http      : www.freescale.com
**     mail      : support@freescale.com
**
**     CPU Registers Revisions:
**               - none
**
**     File-Format-Revisions:
**      - 17.3.2009, V2.27 :
**               - Merged bit-group is not generated, if the name matches with another bit name in the register
**      - 6.4.2009, V2.28 :
**               - Fixed generation of merged bits for bit-groups with a digit at the end, if group-name is defined in CPUDB
**      - 3.8.2009, V2.29 :
**               - If there is just one bits group matching register name, single bits are not generated
**      - 10.9.2009, V2.30 :
**               - Fixed generation of registers arrays.
**      - 15.10.2009, V2.31 :
**               - HCS08 family: Bits and bit-groups are published for 16-bit registers: 8-bit overlay registers are required.
**      - 18.05.2010, V2.32 :
**               - MISRA compliance: U/UL suffixes added to all numbers (_MASK,_BITNUM and addresses)
**
**     Not all general-purpose I/O pins are available on all packages or on all mask sets of a specific
**     derivative device. To avoid extra current drain from floating input pins, the user’s reset
**     initialization routine in the application program must either enable on-chip pull-up devices
**     or change the direction of unconnected pins to outputs so the pins do not float.
** ###################################################################
*/

#ifndef _MC9S08MP16_H
#define _MC9S08MP16_H

/*lint -save  -e950 -esym(960,18.4) -e46 -esym(961,19.7) Disable MISRA rule (1.1,18.4,6.4,19.7) checking. */
/* Types definition */
typedef unsigned char byte;
typedef unsigned int word;
typedef unsigned long dword;
typedef unsigned long dlong[2];

/* Watchdog reset macro */
#ifndef __RESET_WATCHDOG
#ifdef _lint
  #define __RESET_WATCHDOG()  /* empty */
#else
  #define __RESET_WATCHDOG() (void)(SRS = 0x55U, SRS = 0xAAU)
#endif
#endif /* __RESET_WATCHDOG */

#define REG_BASE 0x0000                /* Base address for the I/O register block */


#pragma MESSAGE DISABLE C1106 /* WARNING C1106: Non-standard bitfield type */

/**************** interrupt vector numbers ****************/
#define VectorNumber_VReserved31        31U
#define VectorNumber_Vkeyboard3         30U
#define VectorNumber_Vkeyboard2         29U
#define VectorNumber_Vkeyboard1         28U
#define VectorNumber_Vhscmp3            27U
#define VectorNumber_Vhscmp2            26U
#define VectorNumber_Vhscmp1            25U
#define VectorNumber_Vrtc               24U
#define VectorNumber_Viic               23U
#define VectorNumber_Vscitx             22U
#define VectorNumber_Vscirx             21U
#define VectorNumber_Vscierr            20U
#define VectorNumber_Vspi               19U
#define VectorNumber_Vadc               18U
#define VectorNumber_Vpdb2              17U
#define VectorNumber_Vpdb1              16U
#define VectorNumber_Vmtim              15U
#define VectorNumber_Vftm2ovf           14U
#define VectorNumber_Vftm2ch5           13U
#define VectorNumber_Vftm2ch4           12U
#define VectorNumber_Vftm2ch3           11U
#define VectorNumber_Vftm2ch2           10U
#define VectorNumber_Vftm2ch1           9U
#define VectorNumber_Vftm2ch0           8U
#define VectorNumber_Vftm1ovf           7U
#define VectorNumber_Vftm1ch1           6U
#define VectorNumber_Vftm1ch0           5U
#define VectorNumber_Vftm2fault         4U
#define VectorNumber_Vftm1fault         3U
#define VectorNumber_Vlvw               2U
#define VectorNumber_Vswi               1U
#define VectorNumber_Vreset             0U

/**************** interrupt vector table ****************/
#define VReserved31                     0xFFC0U
#define Vkeyboard3                      0xFFC2U
#define Vkeyboard2                      0xFFC4U
#define Vkeyboard1                      0xFFC6U
#define Vhscmp3                         0xFFC8U
#define Vhscmp2                         0xFFCAU
#define Vhscmp1                         0xFFCCU
#define Vrtc                            0xFFCEU
#define Viic                            0xFFD0U
#define Vscitx                          0xFFD2U
#define Vscirx                          0xFFD4U
#define Vscierr                         0xFFD6U
#define Vspi                            0xFFD8U
#define Vadc                            0xFFDAU
#define Vpdb2                           0xFFDCU
#define Vpdb1                           0xFFDEU
#define Vmtim                           0xFFE0U
#define Vftm2ovf                        0xFFE2U
#define Vftm2ch5                        0xFFE4U
#define Vftm2ch4                        0xFFE6U
#define Vftm2ch3                        0xFFE8U
#define Vftm2ch2                        0xFFEAU
#define Vftm2ch1                        0xFFECU
#define Vftm2ch0                        0xFFEEU
#define Vftm1ovf                        0xFFF0U
#define Vftm1ch1                        0xFFF2U
#define Vftm1ch0                        0xFFF4U
#define Vftm2fault                      0xFFF6U
#define Vftm1fault                      0xFFF8U
#define Vlvw                            0xFFFAU
#define Vswi                            0xFFFCU
#define Vreset                          0xFFFEU

/**************** registers I/O map ****************/

/*** PTAD - Port A Data Register; 0x00000000 ***/
typedef union {
  byte Byte;
  struct {
    byte PTAD0       :1;                                       /* Port A Data Register Bit 0 */
    byte PTAD1       :1;                                       /* Port A Data Register Bit 1 */
    byte PTAD2       :1;                                       /* Port A Data Register Bit 2 */
    byte PTAD3       :1;                                       /* Port A Data Register Bit 3 */
    byte PTAD4       :1;                                       /* Port A Data Register Bit 4 */
    byte PTAD5       :1;                                       /* Port A Data Register Bit 5 */
    byte PTAD6       :1;                                       /* Port A Data Register Bit 6 */
    byte PTAD7       :1;                                       /* Port A Data Register Bit 7 */
  } Bits;
} PTADSTR;
extern volatile PTADSTR _PTAD @0x00000000;
#define PTAD                            _PTAD.Byte
#define PTAD_PTAD0                      _PTAD.Bits.PTAD0
#define PTAD_PTAD1                      _PTAD.Bits.PTAD1
#define PTAD_PTAD2                      _PTAD.Bits.PTAD2
#define PTAD_PTAD3                      _PTAD.Bits.PTAD3
#define PTAD_PTAD4                      _PTAD.Bits.PTAD4
#define PTAD_PTAD5                      _PTAD.Bits.PTAD5
#define PTAD_PTAD6                      _PTAD.Bits.PTAD6
#define PTAD_PTAD7                      _PTAD.Bits.PTAD7

#define PTAD_PTAD0_MASK                 1U
#define PTAD_PTAD1_MASK                 2U
#define PTAD_PTAD2_MASK                 4U
#define PTAD_PTAD3_MASK                 8U
#define PTAD_PTAD4_MASK                 16U
#define PTAD_PTAD5_MASK                 32U
#define PTAD_PTAD6_MASK                 64U
#define PTAD_PTAD7_MASK                 128U


