trv/CL_H100_FW/H100/Project_Headers/mc9s08mp16.h
#define KBI3SC_KBIMOD_MASK              1U
#define KBI3SC_KBIE_MASK                2U
#define KBI3SC_KBACK_MASK               4U
#define KBI3SC_KBF_MASK                 8U


/*** KBI3PE - KBI3 Pin Enable Register; 0x0000002D ***/
typedef union {
  byte Byte;
  struct {
    byte KBIPE0      :1;                                       /* Keyboard Pin Enable for KBI Port Bit 0 */
    byte KBIPE1      :1;                                       /* Keyboard Pin Enable for KBI Port Bit 1 */
    byte KBIPE2      :1;                                       /* Keyboard Pin Enable for KBI Port Bit 2 */
    byte KBIPE3      :1;                                       /* Keyboard Pin Enable for KBI Port Bit 3 */
    byte KBIPE4      :1;                                       /* Keyboard Pin Enable for KBI Port Bit 4 */
    byte KBIPE5      :1;                                       /* Keyboard Pin Enable for KBI Port Bit 5 */
    byte KBIPE6      :1;                                       /* Keyboard Pin Enable for KBI Port Bit 6 */
    byte KBIPE7      :1;                                       /* Keyboard Pin Enable for KBI Port Bit 7 */
  } Bits;
} KBI3PESTR;
extern volatile KBI3PESTR _KBI3PE @0x0000002D;
#define KBI3PE                          _KBI3PE.Byte
#define KBI3PE_KBIPE0                   _KBI3PE.Bits.KBIPE0
#define KBI3PE_KBIPE1                   _KBI3PE.Bits.KBIPE1
#define KBI3PE_KBIPE2                   _KBI3PE.Bits.KBIPE2
#define KBI3PE_KBIPE3                   _KBI3PE.Bits.KBIPE3
#define KBI3PE_KBIPE4                   _KBI3PE.Bits.KBIPE4
#define KBI3PE_KBIPE5                   _KBI3PE.Bits.KBIPE5
#define KBI3PE_KBIPE6                   _KBI3PE.Bits.KBIPE6
#define KBI3PE_KBIPE7                   _KBI3PE.Bits.KBIPE7

#define KBI3PE_KBIPE0_MASK              1U
#define KBI3PE_KBIPE1_MASK              2U
#define KBI3PE_KBIPE2_MASK              4U
#define KBI3PE_KBIPE3_MASK              8U
#define KBI3PE_KBIPE4_MASK              16U
#define KBI3PE_KBIPE5_MASK              32U
#define KBI3PE_KBIPE6_MASK              64U
#define KBI3PE_KBIPE7_MASK              128U


/*** KBI3ES - KBI3 Edge Select Register; 0x0000002E ***/
typedef union {
  byte Byte;
  struct {
    byte KBEDG0      :1;                                       /* Keyboard Edge Select Bit 0 */
    byte KBEDG1      :1;                                       /* Keyboard Edge Select Bit 1 */
    byte KBEDG2      :1;                                       /* Keyboard Edge Select Bit 2 */
    byte KBEDG3      :1;                                       /* Keyboard Edge Select Bit 3 */
    byte KBEDG4      :1;                                       /* Keyboard Edge Select Bit 4 */
    byte KBEDG5      :1;                                       /* Keyboard Edge Select Bit 5 */
    byte KBEDG6      :1;                                       /* Keyboard Edge Select Bit 6 */
    byte KBEDG7      :1;                                       /* Keyboard Edge Select Bit 7 */
  } Bits;
} KBI3ESSTR;
extern volatile KBI3ESSTR _KBI3ES @0x0000002E;
#define KBI3ES                          _KBI3ES.Byte
#define KBI3ES_KBEDG0                   _KBI3ES.Bits.KBEDG0
#define KBI3ES_KBEDG1                   _KBI3ES.Bits.KBEDG1
#define KBI3ES_KBEDG2                   _KBI3ES.Bits.KBEDG2
#define KBI3ES_KBEDG3                   _KBI3ES.Bits.KBEDG3
#define KBI3ES_KBEDG4                   _KBI3ES.Bits.KBEDG4
#define KBI3ES_KBEDG5                   _KBI3ES.Bits.KBEDG5
#define KBI3ES_KBEDG6                   _KBI3ES.Bits.KBEDG6
#define KBI3ES_KBEDG7                   _KBI3ES.Bits.KBEDG7

#define KBI3ES_KBEDG0_MASK              1U
#define KBI3ES_KBEDG1_MASK              2U
#define KBI3ES_KBEDG2_MASK              4U
#define KBI3ES_KBEDG3_MASK              8U
#define KBI3ES_KBEDG4_MASK              16U
#define KBI3ES_KBEDG5_MASK              32U
#define KBI3ES_KBEDG6_MASK              64U
#define KBI3ES_KBEDG7_MASK              128U


/*** FTM1SC - FTM1 Status and Control Register; 0x00000030 ***/
typedef union {
  byte Byte;
  struct {
    byte PS0         :1;                                       /* Prescale Divisor Select Bit 0 */
    byte PS1         :1;                                       /* Prescale Divisor Select Bit 1 */
    byte PS2         :1;                                       /* Prescale Divisor Select Bit 2 */
    byte CLKSA       :1;                                       /* Clock Source Select A */
    byte CLKSB       :1;                                       /* Clock Source Select B */
    byte CPWMS       :1;                                       /* Center-Aligned PWM Select */
    byte TOIE        :1;                                       /* Timer Overflow Interrupt Enable */
    byte TOF         :1;                                       /* Timer Overflow Flag */
  } Bits;
  struct {
    byte grpPS   :3;
    byte grpCLKSx :2;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} FTM1SCSTR;
extern volatile FTM1SCSTR _FTM1SC @0x00000030;
#define FTM1SC                          _FTM1SC.Byte
#define FTM1SC_PS0                      _FTM1SC.Bits.PS0
#define FTM1SC_PS1                      _FTM1SC.Bits.PS1
#define FTM1SC_PS2                      _FTM1SC.Bits.PS2
#define FTM1SC_CLKSA                    _FTM1SC.Bits.CLKSA
#define FTM1SC_CLKSB                    _FTM1SC.Bits.CLKSB
#define FTM1SC_CPWMS                    _FTM1SC.Bits.CPWMS
#define FTM1SC_TOIE                     _FTM1SC.Bits.TOIE
#define FTM1SC_TOF                      _FTM1SC.Bits.TOF
#define FTM1SC_PS                       _FTM1SC.MergedBits.grpPS
#define FTM1SC_CLKSx                    _FTM1SC.MergedBits.grpCLKSx

#define FTM1SC_PS0_MASK                 1U
#define FTM1SC_PS1_MASK                 2U
#define FTM1SC_PS2_MASK                 4U
#define FTM1SC_CLKSA_MASK               8U
#define FTM1SC_CLKSB_MASK               16U
#define FTM1SC_CPWMS_MASK               32U
#define FTM1SC_TOIE_MASK                64U
#define FTM1SC_TOF_MASK                 128U
#define FTM1SC_PS_MASK                  7U
#define FTM1SC_PS_BITNUM                0U
#define FTM1SC_CLKSx_MASK               24U
#define FTM1SC_CLKSx_BITNUM             3U


/*** FTM1CNT - FTM1 Timer Counter Register; 0x00000031 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** FTM1CNTH - FTM1 Timer Counter Register High; 0x00000031 ***/
    union {
      byte Byte;
    } FTM1CNTHSTR;
    #define FTM1CNTH                    _FTM1CNT.Overlap_STR.FTM1CNTHSTR.Byte
    

    /*** FTM1CNTL - FTM1 Timer Counter Register Low; 0x00000032 ***/
    union {
      byte Byte;
    } FTM1CNTLSTR;
    #define FTM1CNTL                    _FTM1CNT.Overlap_STR.FTM1CNTLSTR.Byte
    
  } Overlap_STR;

