trv/CL_H100_FW/H100/Project_Headers/mc9s08mp16.h
extern volatile SPIC2STR _SPIC2 @0x00000059;
#define SPIC2                           _SPIC2.Byte
#define SPIC2_SPC0                      _SPIC2.Bits.SPC0
#define SPIC2_SPISWAI                   _SPIC2.Bits.SPISWAI
#define SPIC2_BIDIROE                   _SPIC2.Bits.BIDIROE
#define SPIC2_MODFEN                    _SPIC2.Bits.MODFEN

#define SPIC2_SPC0_MASK                 1U
#define SPIC2_SPISWAI_MASK              2U
#define SPIC2_BIDIROE_MASK              8U
#define SPIC2_MODFEN_MASK               16U


/*** SPIBR - SPI Baud Rate Register; 0x0000005A ***/
typedef union {
  byte Byte;
  struct {
    byte SPR0        :1;                                       /* SPI Baud Rate Divisor Bit 0 */
    byte SPR1        :1;                                       /* SPI Baud Rate Divisor Bit 1 */
    byte SPR2        :1;                                       /* SPI Baud Rate Divisor Bit 2 */
    byte SPR3        :1;                                       /* SPI Baud Rate Divisor Bit 3 */
    byte SPPR0       :1;                                       /* SPI Baud Rate Prescale Divisor Bit 0 */
    byte SPPR1       :1;                                       /* SPI Baud Rate Prescale Divisor Bit 1 */
    byte SPPR2       :1;                                       /* SPI Baud Rate Prescale Divisor Bit 2 */
    byte             :1; 
  } Bits;
  struct {
    byte grpSPR  :4;
    byte grpSPPR :3;
    byte         :1;
  } MergedBits;
} SPIBRSTR;
extern volatile SPIBRSTR _SPIBR @0x0000005A;
#define SPIBR                           _SPIBR.Byte
#define SPIBR_SPR0                      _SPIBR.Bits.SPR0
#define SPIBR_SPR1                      _SPIBR.Bits.SPR1
#define SPIBR_SPR2                      _SPIBR.Bits.SPR2
#define SPIBR_SPR3                      _SPIBR.Bits.SPR3
#define SPIBR_SPPR0                     _SPIBR.Bits.SPPR0
#define SPIBR_SPPR1                     _SPIBR.Bits.SPPR1
#define SPIBR_SPPR2                     _SPIBR.Bits.SPPR2
#define SPIBR_SPR                       _SPIBR.MergedBits.grpSPR
#define SPIBR_SPPR                      _SPIBR.MergedBits.grpSPPR

#define SPIBR_SPR0_MASK                 1U
#define SPIBR_SPR1_MASK                 2U
#define SPIBR_SPR2_MASK                 4U
#define SPIBR_SPR3_MASK                 8U
#define SPIBR_SPPR0_MASK                16U
#define SPIBR_SPPR1_MASK                32U
#define SPIBR_SPPR2_MASK                64U
#define SPIBR_SPR_MASK                  15U
#define SPIBR_SPR_BITNUM                0U
#define SPIBR_SPPR_MASK                 112U
#define SPIBR_SPPR_BITNUM               4U


/*** SPIS - SPI Status Register; 0x0000005B ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte MODF        :1;                                       /* Master Mode Fault Flag */
    byte SPTEF       :1;                                       /* SPI Transmit Buffer Empty Flag */
    byte             :1; 
    byte SPRF        :1;                                       /* SPI Read Buffer Full Flag */
  } Bits;
} SPISSTR;
extern volatile SPISSTR _SPIS @0x0000005B;
#define SPIS                            _SPIS.Byte
#define SPIS_MODF                       _SPIS.Bits.MODF
#define SPIS_SPTEF                      _SPIS.Bits.SPTEF
#define SPIS_SPRF                       _SPIS.Bits.SPRF

#define SPIS_MODF_MASK                  16U
#define SPIS_SPTEF_MASK                 32U
#define SPIS_SPRF_MASK                  128U


/*** SPID - SPI Data Register; 0x0000005D ***/
typedef union {
  byte Byte;
} SPIDSTR;
extern volatile SPIDSTR _SPID @0x0000005D;
#define SPID                            _SPID.Byte


/*** IPCSC - IPC Status and Control Register; 0x0000005E ***/
typedef union {
  byte Byte;
  struct {
    byte IPM0        :1;                                       /* Interrupt Priority Mask, bit 0 */
    byte IPM1        :1;                                       /* Interrupt Priority Mask, bit 1 */
    byte             :1; 
    byte PULIPM      :1;                                       /* Pull IPM from IPMPS */
    byte PSF         :1;                                       /* Pseudo Stack Full */
    byte PSE         :1;                                       /* Pseudo Stack Empty */
    byte             :1; 
    byte IPCE        :1;                                       /* Interrupt Priority Controller Enable */
  } Bits;
  struct {
    byte grpIPM  :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} IPCSCSTR;
extern volatile IPCSCSTR _IPCSC @0x0000005E;
#define IPCSC                           _IPCSC.Byte
#define IPCSC_IPM0                      _IPCSC.Bits.IPM0
#define IPCSC_IPM1                      _IPCSC.Bits.IPM1
#define IPCSC_PULIPM                    _IPCSC.Bits.PULIPM
#define IPCSC_PSF                       _IPCSC.Bits.PSF
#define IPCSC_PSE                       _IPCSC.Bits.PSE
#define IPCSC_IPCE                      _IPCSC.Bits.IPCE
#define IPCSC_IPM                       _IPCSC.MergedBits.grpIPM

#define IPCSC_IPM0_MASK                 1U
#define IPCSC_IPM1_MASK                 2U
#define IPCSC_PULIPM_MASK               8U
#define IPCSC_PSF_MASK                  16U
#define IPCSC_PSE_MASK                  32U
#define IPCSC_IPCE_MASK                 128U
#define IPCSC_IPM_MASK                  3U
#define IPCSC_IPM_BITNUM                0U


/*** IPMPS - Interrupt Priority Mask Pseudo Stack Register; 0x0000005F ***/
typedef union {
  byte Byte;
  struct {
    byte IPM00       :1;                                       /* Interrupt Priority Mask pseudo stack position 0, bit 0 */
    byte IPM01       :1;                                       /* Interrupt Priority Mask pseudo stack position 0, bit 1 */
    byte IPM10       :1;                                       /* Interrupt Priority Mask pseudo stack position 1, bit 0 */
    byte IPM11       :1;                                       /* Interrupt Priority Mask pseudo stack position 1, bit 1 */
    byte IPM20       :1;                                       /* Interrupt Priority Mask pseudo stack position 2, bit 0 */
    byte IPM21       :1;                                       /* Interrupt Priority Mask pseudo stack position 2, bit 1 */
    byte IPM30       :1;                                       /* Interrupt Priority Mask pseudo stack position 3, bit 0 */
    byte IPM31       :1;                                       /* Interrupt Priority Mask pseudo stack position 3, bit 1 */
  } Bits;
  struct {
    byte grpIPM0 :2;
    byte grpIPM1 :2;
    byte grpIPM2 :2;
    byte grpIPM3 :2;
  } MergedBits;
} IPMPSSTR;
extern volatile IPMPSSTR _IPMPS @0x0000005F;
#define IPMPS                           _IPMPS.Byte
#define IPMPS_IPM00                     _IPMPS.Bits.IPM00
#define IPMPS_IPM01                     _IPMPS.Bits.IPM01
#define IPMPS_IPM10                     _IPMPS.Bits.IPM10
#define IPMPS_IPM11                     _IPMPS.Bits.IPM11
#define IPMPS_IPM20                     _IPMPS.Bits.IPM20
#define IPMPS_IPM21                     _IPMPS.Bits.IPM21
#define IPMPS_IPM30                     _IPMPS.Bits.IPM30
#define IPMPS_IPM31                     _IPMPS.Bits.IPM31
#define IPMPS_IPM0                      _IPMPS.MergedBits.grpIPM0
#define IPMPS_IPM1                      _IPMPS.MergedBits.grpIPM1
#define IPMPS_IPM2                      _IPMPS.MergedBits.grpIPM2
#define IPMPS_IPM3                      _IPMPS.MergedBits.grpIPM3

#define IPMPS_IPM00_MASK                1U
#define IPMPS_IPM01_MASK                2U
#define IPMPS_IPM10_MASK                4U
#define IPMPS_IPM11_MASK                8U
#define IPMPS_IPM20_MASK                16U
#define IPMPS_IPM21_MASK                32U
#define IPMPS_IPM30_MASK                64U
#define IPMPS_IPM31_MASK                128U
#define IPMPS_IPM0_MASK                 3U
#define IPMPS_IPM0_BITNUM               0U
#define IPMPS_IPM1_MASK                 12U
#define IPMPS_IPM1_BITNUM               2U
#define IPMPS_IPM2_MASK                 48U
#define IPMPS_IPM2_BITNUM               4U
#define IPMPS_IPM3_MASK                 192U
#define IPMPS_IPM3_BITNUM               6U


/*** ILRS0 - Interrupt Level Setting Register; 0x00000060 ***/
typedef union {
  byte Byte;
  struct {
    byte ILR00       :1;                                       /* Interrupt Level Register for Source 0, bit 0 */
    byte ILR01       :1;                                       /* Interrupt Level Register for Source 0, bit 1 */
    byte ILR10       :1;                                       /* Interrupt Level Register for Source 1, bit 0 */
    byte ILR11       :1;                                       /* Interrupt Level Register for Source 1, bit 1 */
    byte ILR20       :1;                                       /* Interrupt Level Register for Source 2, bit 0 */
    byte ILR21       :1;                                       /* Interrupt Level Register for Source 2, bit 1 */
    byte ILR30       :1;                                       /* Interrupt Level Register for Source 3, bit 0 */
    byte ILR31       :1;                                       /* Interrupt Level Register for Source 3, bit 1 */
  } Bits;
  struct {
    byte grpILR0 :2;
    byte grpILR1 :2;
    byte grpILR2 :2;
    byte grpILR3 :2;
  } MergedBits;
} ILRS0STR;
extern volatile ILRS0STR _ILRS0 @0x00000060;
#define ILRS0                           _ILRS0.Byte
#define ILRS0_ILR00                     _ILRS0.Bits.ILR00
#define ILRS0_ILR01                     _ILRS0.Bits.ILR01
#define ILRS0_ILR10                     _ILRS0.Bits.ILR10
#define ILRS0_ILR11                     _ILRS0.Bits.ILR11
#define ILRS0_ILR20                     _ILRS0.Bits.ILR20
#define ILRS0_ILR21                     _ILRS0.Bits.ILR21
#define ILRS0_ILR30                     _ILRS0.Bits.ILR30
#define ILRS0_ILR31                     _ILRS0.Bits.ILR31
/* ILRS_ARR: Access 8 ILRSx registers in an array */
#define ILRS_ARR                        ((volatile byte * __far) &ILRS0)
#define ILRS0_ILR0                      _ILRS0.MergedBits.grpILR0
#define ILRS0_ILR1                      _ILRS0.MergedBits.grpILR1
#define ILRS0_ILR2                      _ILRS0.MergedBits.grpILR2
#define ILRS0_ILR3                      _ILRS0.MergedBits.grpILR3

#define ILRS0_ILR00_MASK                1U
#define ILRS0_ILR01_MASK                2U
#define ILRS0_ILR10_MASK                4U
#define ILRS0_ILR11_MASK                8U
#define ILRS0_ILR20_MASK                16U
#define ILRS0_ILR21_MASK                32U
#define ILRS0_ILR30_MASK                64U
#define ILRS0_ILR31_MASK                128U
#define ILRS0_ILR0_MASK                 3U
#define ILRS0_ILR0_BITNUM               0U
#define ILRS0_ILR1_MASK                 12U
#define ILRS0_ILR1_BITNUM               2U
#define ILRS0_ILR2_MASK                 48U
#define ILRS0_ILR2_BITNUM               4U
#define ILRS0_ILR3_MASK                 192U
#define ILRS0_ILR3_BITNUM               6U


/*** ILRS1 - Interrupt Level Setting Register; 0x00000061 ***/
typedef union {
  byte Byte;
  struct {
    byte ILR40       :1;                                       /* Interrupt Level Register for Source 4, bit 0 */
    byte ILR41       :1;                                       /* Interrupt Level Register for Source 4, bit 1 */
    byte ILR50       :1;                                       /* Interrupt Level Register for Source 5, bit 0 */
    byte ILR51       :1;                                       /* Interrupt Level Register for Source 5, bit 1 */
    byte ILR60       :1;                                       /* Interrupt Level Register for Source 6, bit 0 */
    byte ILR61       :1;                                       /* Interrupt Level Register for Source 6, bit 1 */
    byte ILR70       :1;                                       /* Interrupt Level Register for Source 7, bit 0 */
    byte ILR71       :1;                                       /* Interrupt Level Register for Source 7, bit 1 */
  } Bits;
  struct {
    byte grpILR4 :2;
    byte grpILR5 :2;
    byte grpILR6 :2;
    byte grpILR7 :2;
  } MergedBits;
} ILRS1STR;
extern volatile ILRS1STR _ILRS1 @0x00000061;
#define ILRS1                           _ILRS1.Byte
#define ILRS1_ILR40                     _ILRS1.Bits.ILR40
#define ILRS1_ILR41                     _ILRS1.Bits.ILR41
#define ILRS1_ILR50                     _ILRS1.Bits.ILR50
#define ILRS1_ILR51                     _ILRS1.Bits.ILR51
#define ILRS1_ILR60                     _ILRS1.Bits.ILR60
#define ILRS1_ILR61                     _ILRS1.Bits.ILR61
#define ILRS1_ILR70                     _ILRS1.Bits.ILR70
#define ILRS1_ILR71                     _ILRS1.Bits.ILR71
#define ILRS1_ILR4                      _ILRS1.MergedBits.grpILR4
#define ILRS1_ILR5                      _ILRS1.MergedBits.grpILR5
#define ILRS1_ILR6                      _ILRS1.MergedBits.grpILR6
#define ILRS1_ILR7                      _ILRS1.MergedBits.grpILR7

