trv/CL_H100_FW/H100/Project_Headers/mc9s08mp16.h
#define ILRS1_ILR40_MASK                1U
#define ILRS1_ILR41_MASK                2U
#define ILRS1_ILR50_MASK                4U
#define ILRS1_ILR51_MASK                8U
#define ILRS1_ILR60_MASK                16U
#define ILRS1_ILR61_MASK                32U
#define ILRS1_ILR70_MASK                64U
#define ILRS1_ILR71_MASK                128U
#define ILRS1_ILR4_MASK                 3U
#define ILRS1_ILR4_BITNUM               0U
#define ILRS1_ILR5_MASK                 12U
#define ILRS1_ILR5_BITNUM               2U
#define ILRS1_ILR6_MASK                 48U
#define ILRS1_ILR6_BITNUM               4U
#define ILRS1_ILR7_MASK                 192U
#define ILRS1_ILR7_BITNUM               6U


/*** ILRS2 - Interrupt Level Setting Register; 0x00000062 ***/
typedef union {
  byte Byte;
  struct {
    byte ILR80       :1;                                       /* Interrupt Level Register for Source 8, bit 0 */
    byte ILR81       :1;                                       /* Interrupt Level Register for Source 8, bit 1 */
    byte ILR90       :1;                                       /* Interrupt Level Register for Source 9, bit 0 */
    byte ILR91       :1;                                       /* Interrupt Level Register for Source 9, bit 1 */
    byte ILR100      :1;                                       /* Interrupt Level Register for Source 10, bit 0 */
    byte ILR101      :1;                                       /* Interrupt Level Register for Source 10, bit 1 */
    byte ILR110      :1;                                       /* Interrupt Level Register for Source 11, bit 0 */
    byte ILR111      :1;                                       /* Interrupt Level Register for Source 11, bit 1 */
  } Bits;
  struct {
    byte grpILR8 :2;
    byte grpILR9 :2;
    byte grpILR10 :2;
    byte grpILR11 :2;
  } MergedBits;
} ILRS2STR;
extern volatile ILRS2STR _ILRS2 @0x00000062;
#define ILRS2                           _ILRS2.Byte
#define ILRS2_ILR80                     _ILRS2.Bits.ILR80
#define ILRS2_ILR81                     _ILRS2.Bits.ILR81
#define ILRS2_ILR90                     _ILRS2.Bits.ILR90
#define ILRS2_ILR91                     _ILRS2.Bits.ILR91
#define ILRS2_ILR100                    _ILRS2.Bits.ILR100
#define ILRS2_ILR101                    _ILRS2.Bits.ILR101
#define ILRS2_ILR110                    _ILRS2.Bits.ILR110
#define ILRS2_ILR111                    _ILRS2.Bits.ILR111
#define ILRS2_ILR8                      _ILRS2.MergedBits.grpILR8
#define ILRS2_ILR9                      _ILRS2.MergedBits.grpILR9
#define ILRS2_ILR10                     _ILRS2.MergedBits.grpILR10
#define ILRS2_ILR11                     _ILRS2.MergedBits.grpILR11

#define ILRS2_ILR80_MASK                1U
#define ILRS2_ILR81_MASK                2U
#define ILRS2_ILR90_MASK                4U
#define ILRS2_ILR91_MASK                8U
#define ILRS2_ILR100_MASK               16U
#define ILRS2_ILR101_MASK               32U
#define ILRS2_ILR110_MASK               64U
#define ILRS2_ILR111_MASK               128U
#define ILRS2_ILR8_MASK                 3U
#define ILRS2_ILR8_BITNUM               0U
#define ILRS2_ILR9_MASK                 12U
#define ILRS2_ILR9_BITNUM               2U
#define ILRS2_ILR10_MASK                48U
#define ILRS2_ILR10_BITNUM              4U
#define ILRS2_ILR11_MASK                192U
#define ILRS2_ILR11_BITNUM              6U


/*** ILRS3 - Interrupt Level Setting Register; 0x00000063 ***/
typedef union {
  byte Byte;
  struct {
    byte ILR120      :1;                                       /* Interrupt Level Register for Source 12, bit 0 */
    byte ILR121      :1;                                       /* Interrupt Level Register for Source 12, bit 1 */
    byte ILR130      :1;                                       /* Interrupt Level Register for Source 13, bit 0 */
    byte ILR131      :1;                                       /* Interrupt Level Register for Source 13, bit 1 */
    byte ILR140      :1;                                       /* Interrupt Level Register for Source 14, bit 0 */
    byte ILR141      :1;                                       /* Interrupt Level Register for Source 14, bit 1 */
    byte ILR150      :1;                                       /* Interrupt Level Register for Source 15, bit 0 */
    byte ILR151      :1;                                       /* Interrupt Level Register for Source 15, bit 1 */
  } Bits;
  struct {
    byte grpILR12 :2;
    byte grpILR13 :2;
    byte grpILR14 :2;
    byte grpILR15 :2;
  } MergedBits;
} ILRS3STR;
extern volatile ILRS3STR _ILRS3 @0x00000063;
#define ILRS3                           _ILRS3.Byte
#define ILRS3_ILR120                    _ILRS3.Bits.ILR120
#define ILRS3_ILR121                    _ILRS3.Bits.ILR121
#define ILRS3_ILR130                    _ILRS3.Bits.ILR130
#define ILRS3_ILR131                    _ILRS3.Bits.ILR131
#define ILRS3_ILR140                    _ILRS3.Bits.ILR140
#define ILRS3_ILR141                    _ILRS3.Bits.ILR141
#define ILRS3_ILR150                    _ILRS3.Bits.ILR150
#define ILRS3_ILR151                    _ILRS3.Bits.ILR151
#define ILRS3_ILR12                     _ILRS3.MergedBits.grpILR12
#define ILRS3_ILR13                     _ILRS3.MergedBits.grpILR13
#define ILRS3_ILR14                     _ILRS3.MergedBits.grpILR14
#define ILRS3_ILR15                     _ILRS3.MergedBits.grpILR15

#define ILRS3_ILR120_MASK               1U
#define ILRS3_ILR121_MASK               2U
#define ILRS3_ILR130_MASK               4U
#define ILRS3_ILR131_MASK               8U
#define ILRS3_ILR140_MASK               16U
#define ILRS3_ILR141_MASK               32U
#define ILRS3_ILR150_MASK               64U
#define ILRS3_ILR151_MASK               128U
#define ILRS3_ILR12_MASK                3U
#define ILRS3_ILR12_BITNUM              0U
#define ILRS3_ILR13_MASK                12U
#define ILRS3_ILR13_BITNUM              2U
#define ILRS3_ILR14_MASK                48U
#define ILRS3_ILR14_BITNUM              4U
#define ILRS3_ILR15_MASK                192U
#define ILRS3_ILR15_BITNUM              6U


