trv/CL_H100_FW/H100/Project_Headers/mc9s08mp16.h
/*** ILRS4 - Interrupt Level Setting Register; 0x00000064 ***/
typedef union {
  byte Byte;
  struct {
    byte ILR160      :1;                                       /* Interrupt Level Register for Source 16, bit 0 */
    byte ILR161      :1;                                       /* Interrupt Level Register for Source 16, bit 1 */
    byte ILR170      :1;                                       /* Interrupt Level Register for Source 17, bit 0 */
    byte ILR171      :1;                                       /* Interrupt Level Register for Source 17, bit 1 */
    byte ILR180      :1;                                       /* Interrupt Level Register for Source 18, bit 0 */
    byte ILR181      :1;                                       /* Interrupt Level Register for Source 18, bit 1 */
    byte ILR190      :1;                                       /* Interrupt Level Register for Source 19, bit 0 */
    byte ILR191      :1;                                       /* Interrupt Level Register for Source 19, bit 1 */
  } Bits;
  struct {
    byte grpILR16 :2;
    byte grpILR17 :2;
    byte grpILR18 :2;
    byte grpILR19 :2;
  } MergedBits;
} ILRS4STR;
extern volatile ILRS4STR _ILRS4 @0x00000064;
#define ILRS4                           _ILRS4.Byte
#define ILRS4_ILR160                    _ILRS4.Bits.ILR160
#define ILRS4_ILR161                    _ILRS4.Bits.ILR161
#define ILRS4_ILR170                    _ILRS4.Bits.ILR170
#define ILRS4_ILR171                    _ILRS4.Bits.ILR171
#define ILRS4_ILR180                    _ILRS4.Bits.ILR180
#define ILRS4_ILR181                    _ILRS4.Bits.ILR181
#define ILRS4_ILR190                    _ILRS4.Bits.ILR190
#define ILRS4_ILR191                    _ILRS4.Bits.ILR191
#define ILRS4_ILR16                     _ILRS4.MergedBits.grpILR16
#define ILRS4_ILR17                     _ILRS4.MergedBits.grpILR17
#define ILRS4_ILR18                     _ILRS4.MergedBits.grpILR18
#define ILRS4_ILR19                     _ILRS4.MergedBits.grpILR19

#define ILRS4_ILR160_MASK               1U
#define ILRS4_ILR161_MASK               2U
#define ILRS4_ILR170_MASK               4U
#define ILRS4_ILR171_MASK               8U
#define ILRS4_ILR180_MASK               16U
#define ILRS4_ILR181_MASK               32U
#define ILRS4_ILR190_MASK               64U
#define ILRS4_ILR191_MASK               128U
#define ILRS4_ILR16_MASK                3U
#define ILRS4_ILR16_BITNUM              0U
#define ILRS4_ILR17_MASK                12U
#define ILRS4_ILR17_BITNUM              2U
#define ILRS4_ILR18_MASK                48U
#define ILRS4_ILR18_BITNUM              4U
#define ILRS4_ILR19_MASK                192U
#define ILRS4_ILR19_BITNUM              6U


/*** ILRS5 - Interrupt Level Setting Register; 0x00000065 ***/
typedef union {
  byte Byte;
  struct {
    byte ILR200      :1;                                       /* Interrupt Level Register for Source 20, bit 0 */
    byte ILR201      :1;                                       /* Interrupt Level Register for Source 20, bit 1 */
    byte ILR210      :1;                                       /* Interrupt Level Register for Source 21, bit 0 */
    byte ILR211      :1;                                       /* Interrupt Level Register for Source 21, bit 1 */
    byte ILR220      :1;                                       /* Interrupt Level Register for Source 22, bit 0 */
    byte ILR221      :1;                                       /* Interrupt Level Register for Source 22, bit 1 */
    byte ILR230      :1;                                       /* Interrupt Level Register for Source 23, bit 0 */
    byte ILR231      :1;                                       /* Interrupt Level Register for Source 23, bit 1 */
  } Bits;
  struct {
    byte grpILR20 :2;
    byte grpILR21 :2;
    byte grpILR22 :2;
    byte grpILR23 :2;
  } MergedBits;
} ILRS5STR;
extern volatile ILRS5STR _ILRS5 @0x00000065;
#define ILRS5                           _ILRS5.Byte
#define ILRS5_ILR200                    _ILRS5.Bits.ILR200
#define ILRS5_ILR201                    _ILRS5.Bits.ILR201
#define ILRS5_ILR210                    _ILRS5.Bits.ILR210
#define ILRS5_ILR211                    _ILRS5.Bits.ILR211
#define ILRS5_ILR220                    _ILRS5.Bits.ILR220
#define ILRS5_ILR221                    _ILRS5.Bits.ILR221
#define ILRS5_ILR230                    _ILRS5.Bits.ILR230
#define ILRS5_ILR231                    _ILRS5.Bits.ILR231
#define ILRS5_ILR20                     _ILRS5.MergedBits.grpILR20
#define ILRS5_ILR21                     _ILRS5.MergedBits.grpILR21
#define ILRS5_ILR22                     _ILRS5.MergedBits.grpILR22
#define ILRS5_ILR23                     _ILRS5.MergedBits.grpILR23

#define ILRS5_ILR200_MASK               1U
#define ILRS5_ILR201_MASK               2U
#define ILRS5_ILR210_MASK               4U
#define ILRS5_ILR211_MASK               8U
#define ILRS5_ILR220_MASK               16U
#define ILRS5_ILR221_MASK               32U
#define ILRS5_ILR230_MASK               64U
#define ILRS5_ILR231_MASK               128U
#define ILRS5_ILR20_MASK                3U
#define ILRS5_ILR20_BITNUM              0U
#define ILRS5_ILR21_MASK                12U
#define ILRS5_ILR21_BITNUM              2U
#define ILRS5_ILR22_MASK                48U
#define ILRS5_ILR22_BITNUM              4U
#define ILRS5_ILR23_MASK                192U
#define ILRS5_ILR23_BITNUM              6U


/*** ILRS6 - Interrupt Level Setting Register; 0x00000066 ***/
typedef union {
  byte Byte;
  struct {
    byte ILR240      :1;                                       /* Interrupt Level Register for Source 24, bit 0 */
    byte ILR241      :1;                                       /* Interrupt Level Register for Source 24, bit 1 */
    byte ILR250      :1;                                       /* Interrupt Level Register for Source 25, bit 0 */
    byte ILR251      :1;                                       /* Interrupt Level Register for Source 25, bit 1 */
    byte ILR260      :1;                                       /* Interrupt Level Register for Source 26, bit 0 */
    byte ILR261      :1;                                       /* Interrupt Level Register for Source 26, bit 1 */
    byte ILR270      :1;                                       /* Interrupt Level Register for Source 27, bit 0 */
    byte ILR271      :1;                                       /* Interrupt Level Register for Source 27, bit 1 */
  } Bits;
  struct {
    byte grpILR24 :2;
    byte grpILR25 :2;
    byte grpILR26 :2;
    byte grpILR27 :2;
  } MergedBits;
} ILRS6STR;
extern volatile ILRS6STR _ILRS6 @0x00000066;
#define ILRS6                           _ILRS6.Byte
#define ILRS6_ILR240                    _ILRS6.Bits.ILR240
#define ILRS6_ILR241                    _ILRS6.Bits.ILR241
#define ILRS6_ILR250                    _ILRS6.Bits.ILR250
#define ILRS6_ILR251                    _ILRS6.Bits.ILR251
#define ILRS6_ILR260                    _ILRS6.Bits.ILR260
#define ILRS6_ILR261                    _ILRS6.Bits.ILR261
#define ILRS6_ILR270                    _ILRS6.Bits.ILR270
#define ILRS6_ILR271                    _ILRS6.Bits.ILR271
#define ILRS6_ILR24                     _ILRS6.MergedBits.grpILR24
#define ILRS6_ILR25                     _ILRS6.MergedBits.grpILR25
#define ILRS6_ILR26                     _ILRS6.MergedBits.grpILR26
#define ILRS6_ILR27                     _ILRS6.MergedBits.grpILR27

#define ILRS6_ILR240_MASK               1U
#define ILRS6_ILR241_MASK               2U
#define ILRS6_ILR250_MASK               4U
#define ILRS6_ILR251_MASK               8U
#define ILRS6_ILR260_MASK               16U
#define ILRS6_ILR261_MASK               32U
#define ILRS6_ILR270_MASK               64U
#define ILRS6_ILR271_MASK               128U
#define ILRS6_ILR24_MASK                3U
#define ILRS6_ILR24_BITNUM              0U
#define ILRS6_ILR25_MASK                12U
#define ILRS6_ILR25_BITNUM              2U
#define ILRS6_ILR26_MASK                48U
#define ILRS6_ILR26_BITNUM              4U
#define ILRS6_ILR27_MASK                192U
#define ILRS6_ILR27_BITNUM              6U


/*** ILRS7 - Interrupt Level Setting Register; 0x00000067 ***/
typedef union {
  byte Byte;
  struct {
    byte ILR280      :1;                                       /* Interrupt Level Register for Source 28, bit 0 */
    byte ILR281      :1;                                       /* Interrupt Level Register for Source 28, bit 1 */
    byte ILR290      :1;                                       /* Interrupt Level Register for Source 29, bit 0 */
    byte ILR291      :1;                                       /* Interrupt Level Register for Source 29, bit 1 */
    byte ILR300      :1;                                       /* Interrupt Level Register for Source 30, bit 0 */
    byte ILR301      :1;                                       /* Interrupt Level Register for Source 30, bit 1 */
    byte ILR310      :1;                                       /* Interrupt Level Register for Source 31, bit 0 */
    byte ILR311      :1;                                       /* Interrupt Level Register for Source 31, bit 1 */
  } Bits;
  struct {
    byte grpILR28 :2;
    byte grpILR29 :2;
    byte grpILR30 :2;
    byte grpILR31 :2;
  } MergedBits;
} ILRS7STR;
extern volatile ILRS7STR _ILRS7 @0x00000067;
#define ILRS7                           _ILRS7.Byte
#define ILRS7_ILR280                    _ILRS7.Bits.ILR280
#define ILRS7_ILR281                    _ILRS7.Bits.ILR281
#define ILRS7_ILR290                    _ILRS7.Bits.ILR290
#define ILRS7_ILR291                    _ILRS7.Bits.ILR291
#define ILRS7_ILR300                    _ILRS7.Bits.ILR300
#define ILRS7_ILR301                    _ILRS7.Bits.ILR301
#define ILRS7_ILR310                    _ILRS7.Bits.ILR310
#define ILRS7_ILR311                    _ILRS7.Bits.ILR311
#define ILRS7_ILR28                     _ILRS7.MergedBits.grpILR28
#define ILRS7_ILR29                     _ILRS7.MergedBits.grpILR29
#define ILRS7_ILR30                     _ILRS7.MergedBits.grpILR30
#define ILRS7_ILR31                     _ILRS7.MergedBits.grpILR31

