trv/CL_H100_FW/H100/Project_Headers/mc9s08mp16.h
#define SCID_R0_T0_MASK                 1U
#define SCID_R1_T1_MASK                 2U
#define SCID_R2_T2_MASK                 4U
#define SCID_R3_T3_MASK                 8U
#define SCID_R4_T4_MASK                 16U
#define SCID_R5_T5_MASK                 32U
#define SCID_R6_T6_MASK                 64U
#define SCID_R7_T7_MASK                 128U


/*** PDB1CTRL1 - PDB1 Control 1 Register; 0x00000070 ***/
typedef union {
  byte Byte;
  struct {
    byte LDOK        :1;                                       /* Load OK */
    byte ENA         :1;                                       /* Trigger A Enable */
    byte AOS0        :1;                                       /* Trigger A Output Select, bit 0 */
    byte AOS1        :1;                                       /* Trigger A Output Select, bit 1 */
    byte ENB         :1;                                       /* Trigger B Enable */
    byte BOS0        :1;                                       /* Trigger B Output Select, bit 0 */
    byte BOS1        :1;                                       /* Trigger B Output Select, bit 1 */
    byte LDMOD       :1;                                       /* Load mode select */
  } Bits;
  struct {
    byte         :1;
    byte grpENx  :1;
    byte grpAOS  :2;
    byte         :1;
    byte grpBOS  :2;
    byte         :1;
  } MergedBits;
} PDB1CTRL1STR;
extern volatile PDB1CTRL1STR _PDB1CTRL1 @0x00000070;
#define PDB1CTRL1                       _PDB1CTRL1.Byte
#define PDB1CTRL1_LDOK                  _PDB1CTRL1.Bits.LDOK
#define PDB1CTRL1_ENA                   _PDB1CTRL1.Bits.ENA
#define PDB1CTRL1_AOS0                  _PDB1CTRL1.Bits.AOS0
#define PDB1CTRL1_AOS1                  _PDB1CTRL1.Bits.AOS1
#define PDB1CTRL1_ENB                   _PDB1CTRL1.Bits.ENB
#define PDB1CTRL1_BOS0                  _PDB1CTRL1.Bits.BOS0
#define PDB1CTRL1_BOS1                  _PDB1CTRL1.Bits.BOS1
#define PDB1CTRL1_LDMOD                 _PDB1CTRL1.Bits.LDMOD
#define PDB1CTRL1_AOS                   _PDB1CTRL1.MergedBits.grpAOS
#define PDB1CTRL1_BOS                   _PDB1CTRL1.MergedBits.grpBOS

#define PDB1CTRL1_LDOK_MASK             1U
#define PDB1CTRL1_ENA_MASK              2U
#define PDB1CTRL1_AOS0_MASK             4U
#define PDB1CTRL1_AOS1_MASK             8U
#define PDB1CTRL1_ENB_MASK              16U
#define PDB1CTRL1_BOS0_MASK             32U
#define PDB1CTRL1_BOS1_MASK             64U
#define PDB1CTRL1_LDMOD_MASK            128U
#define PDB1CTRL1_AOS_MASK              12U
#define PDB1CTRL1_AOS_BITNUM            2U
#define PDB1CTRL1_BOS_MASK              96U
#define PDB1CTRL1_BOS_BITNUM            5U


/*** PDB1CTRL2 - PDB1 Control 2 Register; 0x00000071 ***/
typedef union {
  byte Byte;
  struct {
    byte SWTRIG      :1;                                       /* Software Trigger */
    byte CONT        :1;                                       /* Continuous Mode Enable */
    byte TRIGSEL0    :1;                                       /* Input Trigger, bit 0 */
    byte TRIGSEL1    :1;                                       /* Input Trigger, bit 1 */
    byte TRIGSEL2    :1;                                       /* Input Trigger, bit 2 */
    byte PRESCALER0  :1;                                       /* Clock Prescaler, bit 0 */
    byte PRESCALER1  :1;                                       /* Clock Prescaler, bit 1 */
    byte PRESCALER2  :1;                                       /* Clock Prescaler, bit 2 */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpTRIGSEL :3;
    byte grpPRESCALER :3;
  } MergedBits;
} PDB1CTRL2STR;
extern volatile PDB1CTRL2STR _PDB1CTRL2 @0x00000071;
#define PDB1CTRL2                       _PDB1CTRL2.Byte
#define PDB1CTRL2_SWTRIG                _PDB1CTRL2.Bits.SWTRIG
#define PDB1CTRL2_CONT                  _PDB1CTRL2.Bits.CONT
#define PDB1CTRL2_TRIGSEL0              _PDB1CTRL2.Bits.TRIGSEL0
#define PDB1CTRL2_TRIGSEL1              _PDB1CTRL2.Bits.TRIGSEL1
#define PDB1CTRL2_TRIGSEL2              _PDB1CTRL2.Bits.TRIGSEL2
#define PDB1CTRL2_PRESCALER0            _PDB1CTRL2.Bits.PRESCALER0
#define PDB1CTRL2_PRESCALER1            _PDB1CTRL2.Bits.PRESCALER1
#define PDB1CTRL2_PRESCALER2            _PDB1CTRL2.Bits.PRESCALER2
#define PDB1CTRL2_TRIGSEL               _PDB1CTRL2.MergedBits.grpTRIGSEL
#define PDB1CTRL2_PRESCALER             _PDB1CTRL2.MergedBits.grpPRESCALER

#define PDB1CTRL2_SWTRIG_MASK           1U
#define PDB1CTRL2_CONT_MASK             2U
#define PDB1CTRL2_TRIGSEL0_MASK         4U
#define PDB1CTRL2_TRIGSEL1_MASK         8U
#define PDB1CTRL2_TRIGSEL2_MASK         16U
#define PDB1CTRL2_PRESCALER0_MASK       32U
#define PDB1CTRL2_PRESCALER1_MASK       64U
#define PDB1CTRL2_PRESCALER2_MASK       128U
#define PDB1CTRL2_TRIGSEL_MASK          28U
#define PDB1CTRL2_TRIGSEL_BITNUM        2U
#define PDB1CTRL2_PRESCALER_MASK        224U
#define PDB1CTRL2_PRESCALER_BITNUM      5U


/*** PDB1DLYA - PDB1 Delay A Register; 0x00000072 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PDB1DLYAH - PDB1 Delay A High Register; 0x00000072 ***/
    union {
      byte Byte;
      struct {
        byte DELAYA8     :1;                                       /* Delay A, bit 8 */
        byte DELAYA9     :1;                                       /* Delay A, bit 9 */
        byte DELAYA10    :1;                                       /* Delay A, bit 10 */
        byte DELAYA11    :1;                                       /* Delay A, bit 11 */
        byte DELAYA12    :1;                                       /* Delay A, bit 12 */
        byte DELAYA13    :1;                                       /* Delay A, bit 13 */
        byte DELAYA14    :1;                                       /* Delay A, bit 14 */
        byte DELAYA15    :1;                                       /* Delay A, bit 15 */
      } Bits;
    } PDB1DLYAHSTR;
    #define PDB1DLYAH                   _PDB1DLYA.Overlap_STR.PDB1DLYAHSTR.Byte
    #define PDB1DLYAH_DELAYA8           _PDB1DLYA.Overlap_STR.PDB1DLYAHSTR.Bits.DELAYA8
    #define PDB1DLYAH_DELAYA9           _PDB1DLYA.Overlap_STR.PDB1DLYAHSTR.Bits.DELAYA9
    #define PDB1DLYAH_DELAYA10          _PDB1DLYA.Overlap_STR.PDB1DLYAHSTR.Bits.DELAYA10
    #define PDB1DLYAH_DELAYA11          _PDB1DLYA.Overlap_STR.PDB1DLYAHSTR.Bits.DELAYA11
    #define PDB1DLYAH_DELAYA12          _PDB1DLYA.Overlap_STR.PDB1DLYAHSTR.Bits.DELAYA12
    #define PDB1DLYAH_DELAYA13          _PDB1DLYA.Overlap_STR.PDB1DLYAHSTR.Bits.DELAYA13
    #define PDB1DLYAH_DELAYA14          _PDB1DLYA.Overlap_STR.PDB1DLYAHSTR.Bits.DELAYA14
    #define PDB1DLYAH_DELAYA15          _PDB1DLYA.Overlap_STR.PDB1DLYAHSTR.Bits.DELAYA15
    
    #define PDB1DLYAH_DELAYA8_MASK      1U
    #define PDB1DLYAH_DELAYA9_MASK      2U
    #define PDB1DLYAH_DELAYA10_MASK     4U
    #define PDB1DLYAH_DELAYA11_MASK     8U
    #define PDB1DLYAH_DELAYA12_MASK     16U
    #define PDB1DLYAH_DELAYA13_MASK     32U
    #define PDB1DLYAH_DELAYA14_MASK     64U
    #define PDB1DLYAH_DELAYA15_MASK     128U
    

