trv/CL_H100_FW/H100/Project_Headers/mc9s08mp16.h
    /*** PDB1DLYAL - PDB1 Delay A Low Register; 0x00000073 ***/
    union {
      byte Byte;
      struct {
        byte DELAYA0     :1;                                       /* Delay A, bit 0 */
        byte DELAYA1     :1;                                       /* Delay A, bit 1 */
        byte DELAYA2     :1;                                       /* Delay A, bit 2 */
        byte DELAYA3     :1;                                       /* Delay A, bit 3 */
        byte DELAYA4     :1;                                       /* Delay A, bit 4 */
        byte DELAYA5     :1;                                       /* Delay A, bit 5 */
        byte DELAYA6     :1;                                       /* Delay A, bit 6 */
        byte DELAYA7     :1;                                       /* Delay A, bit 7 */
      } Bits;
    } PDB1DLYALSTR;
    #define PDB1DLYAL                   _PDB1DLYA.Overlap_STR.PDB1DLYALSTR.Byte
    #define PDB1DLYAL_DELAYA0           _PDB1DLYA.Overlap_STR.PDB1DLYALSTR.Bits.DELAYA0
    #define PDB1DLYAL_DELAYA1           _PDB1DLYA.Overlap_STR.PDB1DLYALSTR.Bits.DELAYA1
    #define PDB1DLYAL_DELAYA2           _PDB1DLYA.Overlap_STR.PDB1DLYALSTR.Bits.DELAYA2
    #define PDB1DLYAL_DELAYA3           _PDB1DLYA.Overlap_STR.PDB1DLYALSTR.Bits.DELAYA3
    #define PDB1DLYAL_DELAYA4           _PDB1DLYA.Overlap_STR.PDB1DLYALSTR.Bits.DELAYA4
    #define PDB1DLYAL_DELAYA5           _PDB1DLYA.Overlap_STR.PDB1DLYALSTR.Bits.DELAYA5
    #define PDB1DLYAL_DELAYA6           _PDB1DLYA.Overlap_STR.PDB1DLYALSTR.Bits.DELAYA6
    #define PDB1DLYAL_DELAYA7           _PDB1DLYA.Overlap_STR.PDB1DLYALSTR.Bits.DELAYA7
    
    #define PDB1DLYAL_DELAYA0_MASK      1U
    #define PDB1DLYAL_DELAYA1_MASK      2U
    #define PDB1DLYAL_DELAYA2_MASK      4U
    #define PDB1DLYAL_DELAYA3_MASK      8U
    #define PDB1DLYAL_DELAYA4_MASK      16U
    #define PDB1DLYAL_DELAYA5_MASK      32U
    #define PDB1DLYAL_DELAYA6_MASK      64U
    #define PDB1DLYAL_DELAYA7_MASK      128U
    
  } Overlap_STR;

} PDB1DLYASTR;
extern volatile PDB1DLYASTR _PDB1DLYA @0x00000072;
#define PDB1DLYA                        _PDB1DLYA.Word


/*** PDB1DLYB - PDB1 Delay B Register; 0x00000074 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PDB1DLYBH - PDB1 Delay B High Register; 0x00000074 ***/
    union {
      byte Byte;
      struct {
        byte DELAYB8     :1;                                       /* Delay B, bit 8 */
        byte DELAYB9     :1;                                       /* Delay B, bit 9 */
        byte DELAYB10    :1;                                       /* Delay B, bit 10 */
        byte DELAYB11    :1;                                       /* Delay B, bit 11 */
        byte DELAYB12    :1;                                       /* Delay B, bit 12 */
        byte DELAYB13    :1;                                       /* Delay B, bit 13 */
        byte DELAYB14    :1;                                       /* Delay B, bit 14 */
        byte DELAYB15    :1;                                       /* Delay B, bit 15 */
      } Bits;
    } PDB1DLYBHSTR;
    #define PDB1DLYBH                   _PDB1DLYB.Overlap_STR.PDB1DLYBHSTR.Byte
    #define PDB1DLYBH_DELAYB8           _PDB1DLYB.Overlap_STR.PDB1DLYBHSTR.Bits.DELAYB8
    #define PDB1DLYBH_DELAYB9           _PDB1DLYB.Overlap_STR.PDB1DLYBHSTR.Bits.DELAYB9
    #define PDB1DLYBH_DELAYB10          _PDB1DLYB.Overlap_STR.PDB1DLYBHSTR.Bits.DELAYB10
    #define PDB1DLYBH_DELAYB11          _PDB1DLYB.Overlap_STR.PDB1DLYBHSTR.Bits.DELAYB11
    #define PDB1DLYBH_DELAYB12          _PDB1DLYB.Overlap_STR.PDB1DLYBHSTR.Bits.DELAYB12
    #define PDB1DLYBH_DELAYB13          _PDB1DLYB.Overlap_STR.PDB1DLYBHSTR.Bits.DELAYB13
    #define PDB1DLYBH_DELAYB14          _PDB1DLYB.Overlap_STR.PDB1DLYBHSTR.Bits.DELAYB14
    #define PDB1DLYBH_DELAYB15          _PDB1DLYB.Overlap_STR.PDB1DLYBHSTR.Bits.DELAYB15
    
    #define PDB1DLYBH_DELAYB8_MASK      1U
    #define PDB1DLYBH_DELAYB9_MASK      2U
    #define PDB1DLYBH_DELAYB10_MASK     4U
    #define PDB1DLYBH_DELAYB11_MASK     8U
    #define PDB1DLYBH_DELAYB12_MASK     16U
    #define PDB1DLYBH_DELAYB13_MASK     32U
    #define PDB1DLYBH_DELAYB14_MASK     64U
    #define PDB1DLYBH_DELAYB15_MASK     128U
    

    /*** PDB1DLYBL - PDB1 Delay B Low Register; 0x00000075 ***/
    union {
      byte Byte;
      struct {
        byte DELAYB0     :1;                                       /* Delay B, bit 0 */
        byte DELAYB1     :1;                                       /* Delay B, bit 1 */
        byte DELAYB2     :1;                                       /* Delay B, bit 2 */
        byte DELAYB3     :1;                                       /* Delay B, bit 3 */
        byte DELAYB4     :1;                                       /* Delay B, bit 4 */
        byte DELAYB5     :1;                                       /* Delay B, bit 5 */
        byte DELAYB6     :1;                                       /* Delay B, bit 6 */
        byte DELAYB7     :1;                                       /* Delay B, bit 7 */
      } Bits;
    } PDB1DLYBLSTR;
    #define PDB1DLYBL                   _PDB1DLYB.Overlap_STR.PDB1DLYBLSTR.Byte
    #define PDB1DLYBL_DELAYB0           _PDB1DLYB.Overlap_STR.PDB1DLYBLSTR.Bits.DELAYB0
    #define PDB1DLYBL_DELAYB1           _PDB1DLYB.Overlap_STR.PDB1DLYBLSTR.Bits.DELAYB1
    #define PDB1DLYBL_DELAYB2           _PDB1DLYB.Overlap_STR.PDB1DLYBLSTR.Bits.DELAYB2
    #define PDB1DLYBL_DELAYB3           _PDB1DLYB.Overlap_STR.PDB1DLYBLSTR.Bits.DELAYB3
    #define PDB1DLYBL_DELAYB4           _PDB1DLYB.Overlap_STR.PDB1DLYBLSTR.Bits.DELAYB4
    #define PDB1DLYBL_DELAYB5           _PDB1DLYB.Overlap_STR.PDB1DLYBLSTR.Bits.DELAYB5
    #define PDB1DLYBL_DELAYB6           _PDB1DLYB.Overlap_STR.PDB1DLYBLSTR.Bits.DELAYB6
    #define PDB1DLYBL_DELAYB7           _PDB1DLYB.Overlap_STR.PDB1DLYBLSTR.Bits.DELAYB7
    
    #define PDB1DLYBL_DELAYB0_MASK      1U
    #define PDB1DLYBL_DELAYB1_MASK      2U
    #define PDB1DLYBL_DELAYB2_MASK      4U
    #define PDB1DLYBL_DELAYB3_MASK      8U
    #define PDB1DLYBL_DELAYB4_MASK      16U
    #define PDB1DLYBL_DELAYB5_MASK      32U
    #define PDB1DLYBL_DELAYB6_MASK      64U
    #define PDB1DLYBL_DELAYB7_MASK      128U
    
  } Overlap_STR;

} PDB1DLYBSTR;
