trv/CL_H100_FW/H100/Project_Headers/mc9s08mp16.h
extern volatile PDB1DLYBSTR _PDB1DLYB @0x00000074;
#define PDB1DLYB                        _PDB1DLYB.Word


/*** PDB1MOD - PDB1 Counter Modulus Register; 0x00000076 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PDB1MODH - PDB1 Counter Modulus High Register; 0x00000076 ***/
    union {
      byte Byte;
      struct {
        byte MOD8        :1;                                       /* Counter Modulus, bit 8 */
        byte MOD9        :1;                                       /* Counter Modulus, bit 9 */
        byte MOD10       :1;                                       /* Counter Modulus, bit 10 */
        byte MOD11       :1;                                       /* Counter Modulus, bit 11 */
        byte MOD12       :1;                                       /* Counter Modulus, bit 12 */
        byte MOD13       :1;                                       /* Counter Modulus, bit 13 */
        byte MOD14       :1;                                       /* Counter Modulus, bit 14 */
        byte MOD15       :1;                                       /* Counter Modulus, bit 15 */
      } Bits;
    } PDB1MODHSTR;
    #define PDB1MODH                    _PDB1MOD.Overlap_STR.PDB1MODHSTR.Byte
    #define PDB1MODH_MOD8               _PDB1MOD.Overlap_STR.PDB1MODHSTR.Bits.MOD8
    #define PDB1MODH_MOD9               _PDB1MOD.Overlap_STR.PDB1MODHSTR.Bits.MOD9
    #define PDB1MODH_MOD10              _PDB1MOD.Overlap_STR.PDB1MODHSTR.Bits.MOD10
    #define PDB1MODH_MOD11              _PDB1MOD.Overlap_STR.PDB1MODHSTR.Bits.MOD11
    #define PDB1MODH_MOD12              _PDB1MOD.Overlap_STR.PDB1MODHSTR.Bits.MOD12
    #define PDB1MODH_MOD13              _PDB1MOD.Overlap_STR.PDB1MODHSTR.Bits.MOD13
    #define PDB1MODH_MOD14              _PDB1MOD.Overlap_STR.PDB1MODHSTR.Bits.MOD14
    #define PDB1MODH_MOD15              _PDB1MOD.Overlap_STR.PDB1MODHSTR.Bits.MOD15
    
    #define PDB1MODH_MOD8_MASK          1U
    #define PDB1MODH_MOD9_MASK          2U
    #define PDB1MODH_MOD10_MASK         4U
    #define PDB1MODH_MOD11_MASK         8U
    #define PDB1MODH_MOD12_MASK         16U
    #define PDB1MODH_MOD13_MASK         32U
    #define PDB1MODH_MOD14_MASK         64U
    #define PDB1MODH_MOD15_MASK         128U
    

    /*** PDB1MODL - PDB1 Counter Modulus Low Register; 0x00000077 ***/
    union {
      byte Byte;
      struct {
        byte MOD0        :1;                                       /* Counter Modulus, bit 0 */
        byte MOD1        :1;                                       /* Counter Modulus, bit 1 */
        byte MOD2        :1;                                       /* Counter Modulus, bit 2 */
        byte MOD3        :1;                                       /* Counter Modulus, bit 3 */
        byte MOD4        :1;                                       /* Counter Modulus, bit 4 */
        byte MOD5        :1;                                       /* Counter Modulus, bit 5 */
        byte MOD6        :1;                                       /* Counter Modulus, bit 6 */
        byte MOD7        :1;                                       /* Counter Modulus, bit 7 */
      } Bits;
    } PDB1MODLSTR;
    #define PDB1MODL                    _PDB1MOD.Overlap_STR.PDB1MODLSTR.Byte
    #define PDB1MODL_MOD0               _PDB1MOD.Overlap_STR.PDB1MODLSTR.Bits.MOD0
    #define PDB1MODL_MOD1               _PDB1MOD.Overlap_STR.PDB1MODLSTR.Bits.MOD1
    #define PDB1MODL_MOD2               _PDB1MOD.Overlap_STR.PDB1MODLSTR.Bits.MOD2
    #define PDB1MODL_MOD3               _PDB1MOD.Overlap_STR.PDB1MODLSTR.Bits.MOD3
    #define PDB1MODL_MOD4               _PDB1MOD.Overlap_STR.PDB1MODLSTR.Bits.MOD4
    #define PDB1MODL_MOD5               _PDB1MOD.Overlap_STR.PDB1MODLSTR.Bits.MOD5
    #define PDB1MODL_MOD6               _PDB1MOD.Overlap_STR.PDB1MODLSTR.Bits.MOD6
    #define PDB1MODL_MOD7               _PDB1MOD.Overlap_STR.PDB1MODLSTR.Bits.MOD7
    
    #define PDB1MODL_MOD0_MASK          1U
    #define PDB1MODL_MOD1_MASK          2U
    #define PDB1MODL_MOD2_MASK          4U
    #define PDB1MODL_MOD3_MASK          8U
    #define PDB1MODL_MOD4_MASK          16U
    #define PDB1MODL_MOD5_MASK          32U
    #define PDB1MODL_MOD6_MASK          64U
    #define PDB1MODL_MOD7_MASK          128U
    
  } Overlap_STR;

} PDB1MODSTR;
extern volatile PDB1MODSTR _PDB1MOD @0x00000076;
#define PDB1MOD                         _PDB1MOD.Word


/*** PDB1CNT - PDB1 Counter Value Register; 0x00000078 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PDB1CNTH - PDB1 Counter Value High Register; 0x00000078 ***/
    union {
      byte Byte;
      struct {
        byte COUNT8      :1;                                       /* Counter Value, bit 8 */
        byte COUNT9      :1;                                       /* Counter Value, bit 9 */
        byte COUNT10     :1;                                       /* Counter Value, bit 10 */
        byte COUNT11     :1;                                       /* Counter Value, bit 11 */
        byte COUNT12     :1;                                       /* Counter Value, bit 12 */
        byte COUNT13     :1;                                       /* Counter Value, bit 13 */
        byte COUNT14     :1;                                       /* Counter Value, bit 14 */
        byte COUNT15     :1;                                       /* Counter Value, bit 15 */
      } Bits;
    } PDB1CNTHSTR;
    #define PDB1CNTH                    _PDB1CNT.Overlap_STR.PDB1CNTHSTR.Byte
    #define PDB1CNTH_COUNT8             _PDB1CNT.Overlap_STR.PDB1CNTHSTR.Bits.COUNT8
    #define PDB1CNTH_COUNT9             _PDB1CNT.Overlap_STR.PDB1CNTHSTR.Bits.COUNT9
    #define PDB1CNTH_COUNT10            _PDB1CNT.Overlap_STR.PDB1CNTHSTR.Bits.COUNT10
    #define PDB1CNTH_COUNT11            _PDB1CNT.Overlap_STR.PDB1CNTHSTR.Bits.COUNT11
    #define PDB1CNTH_COUNT12            _PDB1CNT.Overlap_STR.PDB1CNTHSTR.Bits.COUNT12
    #define PDB1CNTH_COUNT13            _PDB1CNT.Overlap_STR.PDB1CNTHSTR.Bits.COUNT13
    #define PDB1CNTH_COUNT14            _PDB1CNT.Overlap_STR.PDB1CNTHSTR.Bits.COUNT14
    #define PDB1CNTH_COUNT15            _PDB1CNT.Overlap_STR.PDB1CNTHSTR.Bits.COUNT15
    
    #define PDB1CNTH_COUNT8_MASK        1U
    #define PDB1CNTH_COUNT9_MASK        2U
    #define PDB1CNTH_COUNT10_MASK       4U
    #define PDB1CNTH_COUNT11_MASK       8U
    #define PDB1CNTH_COUNT12_MASK       16U
    #define PDB1CNTH_COUNT13_MASK       32U
    #define PDB1CNTH_COUNT14_MASK       64U
    #define PDB1CNTH_COUNT15_MASK       128U
    

    /*** PDB1CNTL - PDB1 Counter Value Low Register; 0x00000079 ***/
    union {
      byte Byte;
      struct {
        byte COUNT0      :1;                                       /* Counter Value, bit 0 */
        byte COUNT1      :1;                                       /* Counter Value, bit 1 */
        byte COUNT2      :1;                                       /* Counter Value, bit 2 */
        byte COUNT3      :1;                                       /* Counter Value, bit 3 */
        byte COUNT4      :1;                                       /* Counter Value, bit 4 */
        byte COUNT5      :1;                                       /* Counter Value, bit 5 */
        byte COUNT6      :1;                                       /* Counter Value, bit 6 */
        byte COUNT7      :1;                                       /* Counter Value, bit 7 */
      } Bits;
    } PDB1CNTLSTR;
    #define PDB1CNTL                    _PDB1CNT.Overlap_STR.PDB1CNTLSTR.Byte
    #define PDB1CNTL_COUNT0             _PDB1CNT.Overlap_STR.PDB1CNTLSTR.Bits.COUNT0
    #define PDB1CNTL_COUNT1             _PDB1CNT.Overlap_STR.PDB1CNTLSTR.Bits.COUNT1
    #define PDB1CNTL_COUNT2             _PDB1CNT.Overlap_STR.PDB1CNTLSTR.Bits.COUNT2
    #define PDB1CNTL_COUNT3             _PDB1CNT.Overlap_STR.PDB1CNTLSTR.Bits.COUNT3
    #define PDB1CNTL_COUNT4             _PDB1CNT.Overlap_STR.PDB1CNTLSTR.Bits.COUNT4
    #define PDB1CNTL_COUNT5             _PDB1CNT.Overlap_STR.PDB1CNTLSTR.Bits.COUNT5
    #define PDB1CNTL_COUNT6             _PDB1CNT.Overlap_STR.PDB1CNTLSTR.Bits.COUNT6
    #define PDB1CNTL_COUNT7             _PDB1CNT.Overlap_STR.PDB1CNTLSTR.Bits.COUNT7
    
    #define PDB1CNTL_COUNT0_MASK        1U
    #define PDB1CNTL_COUNT1_MASK        2U
    #define PDB1CNTL_COUNT2_MASK        4U
    #define PDB1CNTL_COUNT3_MASK        8U
    #define PDB1CNTL_COUNT4_MASK        16U
    #define PDB1CNTL_COUNT5_MASK        32U
    #define PDB1CNTL_COUNT6_MASK        64U
    #define PDB1CNTL_COUNT7_MASK        128U
    
  } Overlap_STR;

} PDB1CNTSTR;
extern volatile PDB1CNTSTR _PDB1CNT @0x00000078;
#define PDB1CNT                         _PDB1CNT.Word


/*** PDB1SCR - PDB1 Status Register; 0x0000007A ***/
typedef union {
  byte Byte;
  struct {
    byte DAIE        :1;                                       /* Delay A successful compare interrupt request enable */
    byte DAF         :1;                                       /* Delay A flag */
    byte DBIE        :1;                                       /* Delay B successful compare interrupt request enable */
    byte DBF         :1;                                       /* Delay B flag */
    byte COIE        :1;                                       /* Counter overflow interrupt request enable */
    byte COF         :1;                                       /* Counter overflow flag */
    byte PDBEN       :1;                                       /* PDB module enable */
    byte PADEN       :1;                                       /* Pulse output PAD enable */
  } Bits;
} PDB1SCRSTR;
extern volatile PDB1SCRSTR _PDB1SCR @0x0000007A;
#define PDB1SCR                         _PDB1SCR.Byte
#define PDB1SCR_DAIE                    _PDB1SCR.Bits.DAIE
#define PDB1SCR_DAF                     _PDB1SCR.Bits.DAF
#define PDB1SCR_DBIE                    _PDB1SCR.Bits.DBIE
#define PDB1SCR_DBF                     _PDB1SCR.Bits.DBF
#define PDB1SCR_COIE                    _PDB1SCR.Bits.COIE
#define PDB1SCR_COF                     _PDB1SCR.Bits.COF
#define PDB1SCR_PDBEN                   _PDB1SCR.Bits.PDBEN
#define PDB1SCR_PADEN                   _PDB1SCR.Bits.PADEN

