trv/CL_H100_FW/H100/Project_Headers/mc9s08mp16.h
#define PDB2CTRL1_LDOK_MASK             1U
#define PDB2CTRL1_LDMOD_MASK            128U


/*** PDB2CTRL2 - PDB2 Control 2 Register; 0x00000081 ***/
typedef union {
  byte Byte;
  struct {
    byte SWTRIG      :1;                                       /* Software Trigger */
    byte CONT        :1;                                       /* Continuous Mode Enable */
    byte TRIGSEL0    :1;                                       /* Input Trigger, bit 0 */
    byte TRIGSEL1    :1;                                       /* Input Trigger, bit 1 */
    byte TRIGSEL2    :1;                                       /* Input Trigger, bit 2 */
    byte PRESCALER0  :1;                                       /* Clock Prescaler, bit 0 */
    byte PRESCALER1  :1;                                       /* Clock Prescaler, bit 1 */
    byte PRESCALER2  :1;                                       /* Clock Prescaler, bit 2 */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpTRIGSEL :3;
    byte grpPRESCALER :3;
  } MergedBits;
} PDB2CTRL2STR;
extern volatile PDB2CTRL2STR _PDB2CTRL2 @0x00000081;
#define PDB2CTRL2                       _PDB2CTRL2.Byte
#define PDB2CTRL2_SWTRIG                _PDB2CTRL2.Bits.SWTRIG
#define PDB2CTRL2_CONT                  _PDB2CTRL2.Bits.CONT
#define PDB2CTRL2_TRIGSEL0              _PDB2CTRL2.Bits.TRIGSEL0
#define PDB2CTRL2_TRIGSEL1              _PDB2CTRL2.Bits.TRIGSEL1
#define PDB2CTRL2_TRIGSEL2              _PDB2CTRL2.Bits.TRIGSEL2
#define PDB2CTRL2_PRESCALER0            _PDB2CTRL2.Bits.PRESCALER0
#define PDB2CTRL2_PRESCALER1            _PDB2CTRL2.Bits.PRESCALER1
#define PDB2CTRL2_PRESCALER2            _PDB2CTRL2.Bits.PRESCALER2
#define PDB2CTRL2_TRIGSEL               _PDB2CTRL2.MergedBits.grpTRIGSEL
#define PDB2CTRL2_PRESCALER             _PDB2CTRL2.MergedBits.grpPRESCALER

#define PDB2CTRL2_SWTRIG_MASK           1U
#define PDB2CTRL2_CONT_MASK             2U
#define PDB2CTRL2_TRIGSEL0_MASK         4U
#define PDB2CTRL2_TRIGSEL1_MASK         8U
#define PDB2CTRL2_TRIGSEL2_MASK         16U
#define PDB2CTRL2_PRESCALER0_MASK       32U
#define PDB2CTRL2_PRESCALER1_MASK       64U
#define PDB2CTRL2_PRESCALER2_MASK       128U
#define PDB2CTRL2_TRIGSEL_MASK          28U
#define PDB2CTRL2_TRIGSEL_BITNUM        2U
#define PDB2CTRL2_PRESCALER_MASK        224U
#define PDB2CTRL2_PRESCALER_BITNUM      5U


/*** PDB2DLYA - PDB2 Delay A Register; 0x00000082 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PDB2DLYAH - PDB2 Delay A High Register; 0x00000082 ***/
    union {
      byte Byte;
      struct {
        byte DELAYA8     :1;                                       /* Delay A, bit 8 */
        byte DELAYA9     :1;                                       /* Delay A, bit 9 */
        byte DELAYA10    :1;                                       /* Delay A, bit 10 */
        byte DELAYA11    :1;                                       /* Delay A, bit 11 */
        byte DELAYA12    :1;                                       /* Delay A, bit 12 */
        byte DELAYA13    :1;                                       /* Delay A, bit 13 */
        byte DELAYA14    :1;                                       /* Delay A, bit 14 */
        byte DELAYA15    :1;                                       /* Delay A, bit 15 */
      } Bits;
    } PDB2DLYAHSTR;
    #define PDB2DLYAH                   _PDB2DLYA.Overlap_STR.PDB2DLYAHSTR.Byte
    #define PDB2DLYAH_DELAYA8           _PDB2DLYA.Overlap_STR.PDB2DLYAHSTR.Bits.DELAYA8
    #define PDB2DLYAH_DELAYA9           _PDB2DLYA.Overlap_STR.PDB2DLYAHSTR.Bits.DELAYA9
    #define PDB2DLYAH_DELAYA10          _PDB2DLYA.Overlap_STR.PDB2DLYAHSTR.Bits.DELAYA10
    #define PDB2DLYAH_DELAYA11          _PDB2DLYA.Overlap_STR.PDB2DLYAHSTR.Bits.DELAYA11
    #define PDB2DLYAH_DELAYA12          _PDB2DLYA.Overlap_STR.PDB2DLYAHSTR.Bits.DELAYA12
    #define PDB2DLYAH_DELAYA13          _PDB2DLYA.Overlap_STR.PDB2DLYAHSTR.Bits.DELAYA13
    #define PDB2DLYAH_DELAYA14          _PDB2DLYA.Overlap_STR.PDB2DLYAHSTR.Bits.DELAYA14
    #define PDB2DLYAH_DELAYA15          _PDB2DLYA.Overlap_STR.PDB2DLYAHSTR.Bits.DELAYA15
    
    #define PDB2DLYAH_DELAYA8_MASK      1U
    #define PDB2DLYAH_DELAYA9_MASK      2U
    #define PDB2DLYAH_DELAYA10_MASK     4U
    #define PDB2DLYAH_DELAYA11_MASK     8U
    #define PDB2DLYAH_DELAYA12_MASK     16U
    #define PDB2DLYAH_DELAYA13_MASK     32U
    #define PDB2DLYAH_DELAYA14_MASK     64U
    #define PDB2DLYAH_DELAYA15_MASK     128U
    

    /*** PDB2DLYAL - PDB2 Delay A Low Register; 0x00000083 ***/
    union {
      byte Byte;
      struct {
        byte DELAYA0     :1;                                       /* Delay A, bit 0 */
        byte DELAYA1     :1;                                       /* Delay A, bit 1 */
        byte DELAYA2     :1;                                       /* Delay A, bit 2 */
        byte DELAYA3     :1;                                       /* Delay A, bit 3 */
        byte DELAYA4     :1;                                       /* Delay A, bit 4 */
        byte DELAYA5     :1;                                       /* Delay A, bit 5 */
        byte DELAYA6     :1;                                       /* Delay A, bit 6 */
        byte DELAYA7     :1;                                       /* Delay A, bit 7 */
      } Bits;
    } PDB2DLYALSTR;
    #define PDB2DLYAL                   _PDB2DLYA.Overlap_STR.PDB2DLYALSTR.Byte
    #define PDB2DLYAL_DELAYA0           _PDB2DLYA.Overlap_STR.PDB2DLYALSTR.Bits.DELAYA0
    #define PDB2DLYAL_DELAYA1           _PDB2DLYA.Overlap_STR.PDB2DLYALSTR.Bits.DELAYA1
    #define PDB2DLYAL_DELAYA2           _PDB2DLYA.Overlap_STR.PDB2DLYALSTR.Bits.DELAYA2
    #define PDB2DLYAL_DELAYA3           _PDB2DLYA.Overlap_STR.PDB2DLYALSTR.Bits.DELAYA3
    #define PDB2DLYAL_DELAYA4           _PDB2DLYA.Overlap_STR.PDB2DLYALSTR.Bits.DELAYA4
    #define PDB2DLYAL_DELAYA5           _PDB2DLYA.Overlap_STR.PDB2DLYALSTR.Bits.DELAYA5
    #define PDB2DLYAL_DELAYA6           _PDB2DLYA.Overlap_STR.PDB2DLYALSTR.Bits.DELAYA6
    #define PDB2DLYAL_DELAYA7           _PDB2DLYA.Overlap_STR.PDB2DLYALSTR.Bits.DELAYA7
    
    #define PDB2DLYAL_DELAYA0_MASK      1U
    #define PDB2DLYAL_DELAYA1_MASK      2U
    #define PDB2DLYAL_DELAYA2_MASK      4U
    #define PDB2DLYAL_DELAYA3_MASK      8U
    #define PDB2DLYAL_DELAYA4_MASK      16U
    #define PDB2DLYAL_DELAYA5_MASK      32U
    #define PDB2DLYAL_DELAYA6_MASK      64U
    #define PDB2DLYAL_DELAYA7_MASK      128U
    
  } Overlap_STR;

} PDB2DLYASTR;
extern volatile PDB2DLYASTR _PDB2DLYA @0x00000082;
#define PDB2DLYA                        _PDB2DLYA.Word


/*** PDB2DLYB - PDB2 Delay B Register; 0x00000084 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PDB2DLYBH - PDB2 Delay B High Register; 0x00000084 ***/
    union {
      byte Byte;
      struct {
        byte DELAYB8     :1;                                       /* Delay B, bit 8 */
        byte DELAYB9     :1;                                       /* Delay B, bit 9 */
        byte DELAYB10    :1;                                       /* Delay B, bit 10 */
        byte DELAYB11    :1;                                       /* Delay B, bit 11 */
        byte DELAYB12    :1;                                       /* Delay B, bit 12 */
        byte DELAYB13    :1;                                       /* Delay B, bit 13 */
        byte DELAYB14    :1;                                       /* Delay B, bit 14 */
        byte DELAYB15    :1;                                       /* Delay B, bit 15 */
      } Bits;
    } PDB2DLYBHSTR;
    #define PDB2DLYBH                   _PDB2DLYB.Overlap_STR.PDB2DLYBHSTR.Byte
    #define PDB2DLYBH_DELAYB8           _PDB2DLYB.Overlap_STR.PDB2DLYBHSTR.Bits.DELAYB8
    #define PDB2DLYBH_DELAYB9           _PDB2DLYB.Overlap_STR.PDB2DLYBHSTR.Bits.DELAYB9
    #define PDB2DLYBH_DELAYB10          _PDB2DLYB.Overlap_STR.PDB2DLYBHSTR.Bits.DELAYB10
    #define PDB2DLYBH_DELAYB11          _PDB2DLYB.Overlap_STR.PDB2DLYBHSTR.Bits.DELAYB11
    #define PDB2DLYBH_DELAYB12          _PDB2DLYB.Overlap_STR.PDB2DLYBHSTR.Bits.DELAYB12
    #define PDB2DLYBH_DELAYB13          _PDB2DLYB.Overlap_STR.PDB2DLYBHSTR.Bits.DELAYB13
    #define PDB2DLYBH_DELAYB14          _PDB2DLYB.Overlap_STR.PDB2DLYBHSTR.Bits.DELAYB14
    #define PDB2DLYBH_DELAYB15          _PDB2DLYB.Overlap_STR.PDB2DLYBHSTR.Bits.DELAYB15
    
    #define PDB2DLYBH_DELAYB8_MASK      1U
    #define PDB2DLYBH_DELAYB9_MASK      2U
    #define PDB2DLYBH_DELAYB10_MASK     4U
    #define PDB2DLYBH_DELAYB11_MASK     8U
    #define PDB2DLYBH_DELAYB12_MASK     16U
    #define PDB2DLYBH_DELAYB13_MASK     32U
    #define PDB2DLYBH_DELAYB14_MASK     64U
    #define PDB2DLYBH_DELAYB15_MASK     128U
    

    /*** PDB2DLYBL - PDB2 Delay B Low Register; 0x00000085 ***/
    union {
      byte Byte;
      struct {
        byte DELAYB0     :1;                                       /* Delay B, bit 0 */
        byte DELAYB1     :1;                                       /* Delay B, bit 1 */
        byte DELAYB2     :1;                                       /* Delay B, bit 2 */
        byte DELAYB3     :1;                                       /* Delay B, bit 3 */
        byte DELAYB4     :1;                                       /* Delay B, bit 4 */
        byte DELAYB5     :1;                                       /* Delay B, bit 5 */
        byte DELAYB6     :1;                                       /* Delay B, bit 6 */
        byte DELAYB7     :1;                                       /* Delay B, bit 7 */
      } Bits;
    } PDB2DLYBLSTR;
    #define PDB2DLYBL                   _PDB2DLYB.Overlap_STR.PDB2DLYBLSTR.Byte
    #define PDB2DLYBL_DELAYB0           _PDB2DLYB.Overlap_STR.PDB2DLYBLSTR.Bits.DELAYB0
    #define PDB2DLYBL_DELAYB1           _PDB2DLYB.Overlap_STR.PDB2DLYBLSTR.Bits.DELAYB1
    #define PDB2DLYBL_DELAYB2           _PDB2DLYB.Overlap_STR.PDB2DLYBLSTR.Bits.DELAYB2
    #define PDB2DLYBL_DELAYB3           _PDB2DLYB.Overlap_STR.PDB2DLYBLSTR.Bits.DELAYB3
    #define PDB2DLYBL_DELAYB4           _PDB2DLYB.Overlap_STR.PDB2DLYBLSTR.Bits.DELAYB4
    #define PDB2DLYBL_DELAYB5           _PDB2DLYB.Overlap_STR.PDB2DLYBLSTR.Bits.DELAYB5
    #define PDB2DLYBL_DELAYB6           _PDB2DLYB.Overlap_STR.PDB2DLYBLSTR.Bits.DELAYB6
    #define PDB2DLYBL_DELAYB7           _PDB2DLYB.Overlap_STR.PDB2DLYBLSTR.Bits.DELAYB7
    
    #define PDB2DLYBL_DELAYB0_MASK      1U
    #define PDB2DLYBL_DELAYB1_MASK      2U
    #define PDB2DLYBL_DELAYB2_MASK      4U
    #define PDB2DLYBL_DELAYB3_MASK      8U
    #define PDB2DLYBL_DELAYB4_MASK      16U
    #define PDB2DLYBL_DELAYB5_MASK      32U
    #define PDB2DLYBL_DELAYB6_MASK      64U
    #define PDB2DLYBL_DELAYB7_MASK      128U
    
  } Overlap_STR;

} PDB2DLYBSTR;
