trv/CL_H100_FW/H100/Project_Headers/mc9s08mp16.h
extern volatile PDB2DLYBSTR _PDB2DLYB @0x00000084;
#define PDB2DLYB                        _PDB2DLYB.Word


/*** PDB2MOD - PDB2 Counter Modulus Register; 0x00000086 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PDB2MODH - PDB2 Counter Modulus High Register; 0x00000086 ***/
    union {
      byte Byte;
      struct {
        byte MOD8        :1;                                       /* Counter Modulus, bit 8 */
        byte MOD9        :1;                                       /* Counter Modulus, bit 9 */
        byte MOD10       :1;                                       /* Counter Modulus, bit 10 */
        byte MOD11       :1;                                       /* Counter Modulus, bit 11 */
        byte MOD12       :1;                                       /* Counter Modulus, bit 12 */
        byte MOD13       :1;                                       /* Counter Modulus, bit 13 */
        byte MOD14       :1;                                       /* Counter Modulus, bit 14 */
        byte MOD15       :1;                                       /* Counter Modulus, bit 15 */
      } Bits;
    } PDB2MODHSTR;
    #define PDB2MODH                    _PDB2MOD.Overlap_STR.PDB2MODHSTR.Byte
    #define PDB2MODH_MOD8               _PDB2MOD.Overlap_STR.PDB2MODHSTR.Bits.MOD8
    #define PDB2MODH_MOD9               _PDB2MOD.Overlap_STR.PDB2MODHSTR.Bits.MOD9
    #define PDB2MODH_MOD10              _PDB2MOD.Overlap_STR.PDB2MODHSTR.Bits.MOD10
    #define PDB2MODH_MOD11              _PDB2MOD.Overlap_STR.PDB2MODHSTR.Bits.MOD11
    #define PDB2MODH_MOD12              _PDB2MOD.Overlap_STR.PDB2MODHSTR.Bits.MOD12
    #define PDB2MODH_MOD13              _PDB2MOD.Overlap_STR.PDB2MODHSTR.Bits.MOD13
    #define PDB2MODH_MOD14              _PDB2MOD.Overlap_STR.PDB2MODHSTR.Bits.MOD14
    #define PDB2MODH_MOD15              _PDB2MOD.Overlap_STR.PDB2MODHSTR.Bits.MOD15
    
    #define PDB2MODH_MOD8_MASK          1U
    #define PDB2MODH_MOD9_MASK          2U
    #define PDB2MODH_MOD10_MASK         4U
    #define PDB2MODH_MOD11_MASK         8U
    #define PDB2MODH_MOD12_MASK         16U
    #define PDB2MODH_MOD13_MASK         32U
    #define PDB2MODH_MOD14_MASK         64U
    #define PDB2MODH_MOD15_MASK         128U
    

    /*** PDB2MODL - PDB2 Counter Modulus Low Register; 0x00000087 ***/
    union {
      byte Byte;
      struct {
        byte MOD0        :1;                                       /* Counter Modulus, bit 0 */
        byte MOD1        :1;                                       /* Counter Modulus, bit 1 */
        byte MOD2        :1;                                       /* Counter Modulus, bit 2 */
        byte MOD3        :1;                                       /* Counter Modulus, bit 3 */
        byte MOD4        :1;                                       /* Counter Modulus, bit 4 */
        byte MOD5        :1;                                       /* Counter Modulus, bit 5 */
        byte MOD6        :1;                                       /* Counter Modulus, bit 6 */
        byte MOD7        :1;                                       /* Counter Modulus, bit 7 */
      } Bits;
    } PDB2MODLSTR;
    #define PDB2MODL                    _PDB2MOD.Overlap_STR.PDB2MODLSTR.Byte
    #define PDB2MODL_MOD0               _PDB2MOD.Overlap_STR.PDB2MODLSTR.Bits.MOD0
    #define PDB2MODL_MOD1               _PDB2MOD.Overlap_STR.PDB2MODLSTR.Bits.MOD1
    #define PDB2MODL_MOD2               _PDB2MOD.Overlap_STR.PDB2MODLSTR.Bits.MOD2
    #define PDB2MODL_MOD3               _PDB2MOD.Overlap_STR.PDB2MODLSTR.Bits.MOD3
    #define PDB2MODL_MOD4               _PDB2MOD.Overlap_STR.PDB2MODLSTR.Bits.MOD4
    #define PDB2MODL_MOD5               _PDB2MOD.Overlap_STR.PDB2MODLSTR.Bits.MOD5
    #define PDB2MODL_MOD6               _PDB2MOD.Overlap_STR.PDB2MODLSTR.Bits.MOD6
    #define PDB2MODL_MOD7               _PDB2MOD.Overlap_STR.PDB2MODLSTR.Bits.MOD7
    
    #define PDB2MODL_MOD0_MASK          1U
    #define PDB2MODL_MOD1_MASK          2U
    #define PDB2MODL_MOD2_MASK          4U
    #define PDB2MODL_MOD3_MASK          8U
    #define PDB2MODL_MOD4_MASK          16U
    #define PDB2MODL_MOD5_MASK          32U
    #define PDB2MODL_MOD6_MASK          64U
    #define PDB2MODL_MOD7_MASK          128U
    
  } Overlap_STR;

} PDB2MODSTR;
extern volatile PDB2MODSTR _PDB2MOD @0x00000086;
#define PDB2MOD                         _PDB2MOD.Word


/*** PDB2CNT - PDB2 Counter Value Register; 0x00000088 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PDB2CNTH - PDB2 Counter Value High Register; 0x00000088 ***/
    union {
      byte Byte;
      struct {
        byte COUNT8      :1;                                       /* Counter Value, bit 8 */
        byte COUNT9      :1;                                       /* Counter Value, bit 9 */
        byte COUNT10     :1;                                       /* Counter Value, bit 10 */
        byte COUNT11     :1;                                       /* Counter Value, bit 11 */
        byte COUNT12     :1;                                       /* Counter Value, bit 12 */
        byte COUNT13     :1;                                       /* Counter Value, bit 13 */
        byte COUNT14     :1;                                       /* Counter Value, bit 14 */
        byte COUNT15     :1;                                       /* Counter Value, bit 15 */
      } Bits;
    } PDB2CNTHSTR;
    #define PDB2CNTH                    _PDB2CNT.Overlap_STR.PDB2CNTHSTR.Byte
    #define PDB2CNTH_COUNT8             _PDB2CNT.Overlap_STR.PDB2CNTHSTR.Bits.COUNT8
    #define PDB2CNTH_COUNT9             _PDB2CNT.Overlap_STR.PDB2CNTHSTR.Bits.COUNT9
    #define PDB2CNTH_COUNT10            _PDB2CNT.Overlap_STR.PDB2CNTHSTR.Bits.COUNT10
    #define PDB2CNTH_COUNT11            _PDB2CNT.Overlap_STR.PDB2CNTHSTR.Bits.COUNT11
    #define PDB2CNTH_COUNT12            _PDB2CNT.Overlap_STR.PDB2CNTHSTR.Bits.COUNT12
    #define PDB2CNTH_COUNT13            _PDB2CNT.Overlap_STR.PDB2CNTHSTR.Bits.COUNT13
    #define PDB2CNTH_COUNT14            _PDB2CNT.Overlap_STR.PDB2CNTHSTR.Bits.COUNT14
    #define PDB2CNTH_COUNT15            _PDB2CNT.Overlap_STR.PDB2CNTHSTR.Bits.COUNT15
    
