trv/CL_H100_FW/H100/Project_Headers/mc9s08mp16.h
    #define PDB2CNTH_COUNT8_MASK        1U
    #define PDB2CNTH_COUNT9_MASK        2U
    #define PDB2CNTH_COUNT10_MASK       4U
    #define PDB2CNTH_COUNT11_MASK       8U
    #define PDB2CNTH_COUNT12_MASK       16U
    #define PDB2CNTH_COUNT13_MASK       32U
    #define PDB2CNTH_COUNT14_MASK       64U
    #define PDB2CNTH_COUNT15_MASK       128U
    

    /*** PDB2CNTL - PDB2 Counter Value Low Register; 0x00000089 ***/
    union {
      byte Byte;
      struct {
        byte COUNT0      :1;                                       /* Counter Value, bit 0 */
        byte COUNT1      :1;                                       /* Counter Value, bit 1 */
        byte COUNT2      :1;                                       /* Counter Value, bit 2 */
        byte COUNT3      :1;                                       /* Counter Value, bit 3 */
        byte COUNT4      :1;                                       /* Counter Value, bit 4 */
        byte COUNT5      :1;                                       /* Counter Value, bit 5 */
        byte COUNT6      :1;                                       /* Counter Value, bit 6 */
        byte COUNT7      :1;                                       /* Counter Value, bit 7 */
      } Bits;
    } PDB2CNTLSTR;
    #define PDB2CNTL                    _PDB2CNT.Overlap_STR.PDB2CNTLSTR.Byte
    #define PDB2CNTL_COUNT0             _PDB2CNT.Overlap_STR.PDB2CNTLSTR.Bits.COUNT0
    #define PDB2CNTL_COUNT1             _PDB2CNT.Overlap_STR.PDB2CNTLSTR.Bits.COUNT1
    #define PDB2CNTL_COUNT2             _PDB2CNT.Overlap_STR.PDB2CNTLSTR.Bits.COUNT2
    #define PDB2CNTL_COUNT3             _PDB2CNT.Overlap_STR.PDB2CNTLSTR.Bits.COUNT3
    #define PDB2CNTL_COUNT4             _PDB2CNT.Overlap_STR.PDB2CNTLSTR.Bits.COUNT4
    #define PDB2CNTL_COUNT5             _PDB2CNT.Overlap_STR.PDB2CNTLSTR.Bits.COUNT5
    #define PDB2CNTL_COUNT6             _PDB2CNT.Overlap_STR.PDB2CNTLSTR.Bits.COUNT6
    #define PDB2CNTL_COUNT7             _PDB2CNT.Overlap_STR.PDB2CNTLSTR.Bits.COUNT7
    
    #define PDB2CNTL_COUNT0_MASK        1U
    #define PDB2CNTL_COUNT1_MASK        2U
    #define PDB2CNTL_COUNT2_MASK        4U
    #define PDB2CNTL_COUNT3_MASK        8U
    #define PDB2CNTL_COUNT4_MASK        16U
    #define PDB2CNTL_COUNT5_MASK        32U
    #define PDB2CNTL_COUNT6_MASK        64U
    #define PDB2CNTL_COUNT7_MASK        128U
    
  } Overlap_STR;

} PDB2CNTSTR;
extern volatile PDB2CNTSTR _PDB2CNT @0x00000088;
#define PDB2CNT                         _PDB2CNT.Word


/*** PDB2SCR - PDB2 Status Register; 0x0000008A ***/
typedef union {
  byte Byte;
  struct {
    byte DAIE        :1;                                       /* Delay A successful compare interrupt request enable */
    byte DAF         :1;                                       /* Delay A flag */
    byte DBIE        :1;                                       /* Delay B successful compare interrupt request enable */
    byte DBF         :1;                                       /* Delay B flag */
    byte COIE        :1;                                       /* Counter overflow interrupt request enable */
    byte COF         :1;                                       /* Counter overflow flag */
    byte PDBEN       :1;                                       /* PDB module enable */
    byte PADEN       :1;                                       /* Pulse output PAD enable */
  } Bits;
} PDB2SCRSTR;
extern volatile PDB2SCRSTR _PDB2SCR @0x0000008A;
#define PDB2SCR                         _PDB2SCR.Byte
#define PDB2SCR_DAIE                    _PDB2SCR.Bits.DAIE
#define PDB2SCR_DAF                     _PDB2SCR.Bits.DAF
#define PDB2SCR_DBIE                    _PDB2SCR.Bits.DBIE
#define PDB2SCR_DBF                     _PDB2SCR.Bits.DBF
#define PDB2SCR_COIE                    _PDB2SCR.Bits.COIE
#define PDB2SCR_COF                     _PDB2SCR.Bits.COF
#define PDB2SCR_PDBEN                   _PDB2SCR.Bits.PDBEN
#define PDB2SCR_PADEN                   _PDB2SCR.Bits.PADEN

#define PDB2SCR_DAIE_MASK               1U
#define PDB2SCR_DAF_MASK                2U
#define PDB2SCR_DBIE_MASK               4U
#define PDB2SCR_DBF_MASK                8U
#define PDB2SCR_COIE_MASK               16U
#define PDB2SCR_COF_MASK                32U
#define PDB2SCR_PDBEN_MASK              64U
#define PDB2SCR_PADEN_MASK              128U


/*** RTCSC - RTC Status and Control Register; 0x0000008C ***/
typedef union {
  byte Byte;
  struct {
    byte RTCPS0      :1;                                       /* Real-Time Clock Prescaler Select, bit 0 */
    byte RTCPS1      :1;                                       /* Real-Time Clock Prescaler Select, bit 1 */
    byte RTCPS2      :1;                                       /* Real-Time Clock Prescaler Select, bit 2 */
    byte RTCPS3      :1;                                       /* Real-Time Clock Prescaler Select, bit 3 */
    byte RTIE        :1;                                       /* Real-Time Interrupt Enable */
    byte RTCLKS0     :1;                                       /* Real-Time Clock Source Select, bit 0 */
    byte RTCLKS1     :1;                                       /* Real-Time Clock Source Select, bit 1 */
    byte RTIF        :1;                                       /* Real-Time Interrupt Flag */
  } Bits;
  struct {
    byte grpRTCPS :4;
    byte         :1;
    byte grpRTCLKS :2;
    byte         :1;
  } MergedBits;
} RTCSCSTR;
extern volatile RTCSCSTR _RTCSC @0x0000008C;
#define RTCSC                           _RTCSC.Byte
#define RTCSC_RTCPS0                    _RTCSC.Bits.RTCPS0
#define RTCSC_RTCPS1                    _RTCSC.Bits.RTCPS1
#define RTCSC_RTCPS2                    _RTCSC.Bits.RTCPS2
#define RTCSC_RTCPS3                    _RTCSC.Bits.RTCPS3
#define RTCSC_RTIE                      _RTCSC.Bits.RTIE
#define RTCSC_RTCLKS0                   _RTCSC.Bits.RTCLKS0
#define RTCSC_RTCLKS1                   _RTCSC.Bits.RTCLKS1
#define RTCSC_RTIF                      _RTCSC.Bits.RTIF
#define RTCSC_RTCPS                     _RTCSC.MergedBits.grpRTCPS
#define RTCSC_RTCLKS                    _RTCSC.MergedBits.grpRTCLKS

#define RTCSC_RTCPS0_MASK               1U
#define RTCSC_RTCPS1_MASK               2U
#define RTCSC_RTCPS2_MASK               4U
#define RTCSC_RTCPS3_MASK               8U
#define RTCSC_RTIE_MASK                 16U
#define RTCSC_RTCLKS0_MASK              32U
#define RTCSC_RTCLKS1_MASK              64U
#define RTCSC_RTIF_MASK                 128U
#define RTCSC_RTCPS_MASK                15U
#define RTCSC_RTCPS_BITNUM              0U
#define RTCSC_RTCLKS_MASK               96U
#define RTCSC_RTCLKS_BITNUM             5U


/*** RTCCNT - RTC Counter Register; 0x0000008D ***/
typedef union {
  byte Byte;
} RTCCNTSTR;
extern volatile RTCCNTSTR _RTCCNT @0x0000008D;
#define RTCCNT                          _RTCCNT.Byte


/*** RTCMOD - RTC Modulo Register; 0x0000008E ***/
typedef union {
  byte Byte;
} RTCMODSTR;
extern volatile RTCMODSTR _RTCMOD @0x0000008E;
#define RTCMOD                          _RTCMOD.Byte


/*** SRS - System Reset Status Register; 0x00001800 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte LVD         :1;                                       /* Low Voltage Detect */
    byte             :1; 
    byte ILAD        :1;                                       /* Illegal Address */
    byte ILOP        :1;                                       /* Illegal Opcode */
    byte COP         :1;                                       /* Computer Operating Properly (COP) Watchdog */
    byte PIN         :1;                                       /* External Reset Pin */
    byte POR         :1;                                       /* Power-On Reset */
  } Bits;
} SRSSTR;
