trv/CL_H100_FW/H100/Project_Headers/mc9s08mp16.h
#define SPMSC1_BGBE_MASK                1U
#define SPMSC1_LVDE_MASK                4U
#define SPMSC1_LVDSE_MASK               8U
#define SPMSC1_LVDRE_MASK               16U
#define SPMSC1_LVWIE_MASK               32U
#define SPMSC1_LVWACK_MASK              64U
#define SPMSC1_LVWF_MASK                128U


/*** SPMSC2 - System Power Management Status and Control 2 Register; 0x0000180A ***/
typedef union {
  byte Byte;
  struct {
    byte PPDC        :1;                                       /* Partial Power Down Control */
    byte             :1; 
    byte PPDACK      :1;                                       /* Partial Power Down Acknowledge */
    byte PPDF        :1;                                       /* Partial Power Down Flag */
    byte LVWV        :1;                                       /* Low-Voltage Warning Voltage Select */
    byte LVDV        :1;                                       /* Low-Voltage Detect Voltage Select */
    byte             :1; 
    byte             :1; 
  } Bits;
} SPMSC2STR;
extern volatile SPMSC2STR _SPMSC2 @0x0000180A;
#define SPMSC2                          _SPMSC2.Byte
#define SPMSC2_PPDC                     _SPMSC2.Bits.PPDC
#define SPMSC2_PPDACK                   _SPMSC2.Bits.PPDACK
#define SPMSC2_PPDF                     _SPMSC2.Bits.PPDF
#define SPMSC2_LVWV                     _SPMSC2.Bits.LVWV
#define SPMSC2_LVDV                     _SPMSC2.Bits.LVDV

#define SPMSC2_PPDC_MASK                1U
#define SPMSC2_PPDACK_MASK              4U
#define SPMSC2_PPDF_MASK                8U
#define SPMSC2_LVWV_MASK                16U
#define SPMSC2_LVDV_MASK                32U


/*** SOPT3 - System Options Register 3; 0x0000180B ***/
typedef union {
  byte Byte;
  struct {
    byte SYNCFTM     :1;                                       /* Synchronize FTM */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} SOPT3STR;
extern volatile SOPT3STR _SOPT3 @0x0000180B;
#define SOPT3                           _SOPT3.Byte
#define SOPT3_SYNCFTM                   _SOPT3.Bits.SYNCFTM

#define SOPT3_SYNCFTM_MASK              1U


/*** SCGC1 - System Clock Gating Control 1 Register; 0x0000180E ***/
typedef union {
  byte Byte;
  struct {
    byte CMPDAC1     :1;                                       /* HSCMP1 and DAC1 Clock Gate Control */
    byte CMPDAC2     :1;                                       /* HSCMP2 and DAC2 Clock Gate Control */
    byte CMPDAC3     :1;                                       /* HSCMP3 and DAC3 Clock Gate Control */
    byte PDB         :1;                                       /* PDB1 and PDB2 Clock Gate Control */
    byte RTC         :1;                                       /* RTC Clock Gate Control */
    byte MTIM        :1;                                       /* MTIM Clock Gate Control */
    byte FTM1        :1;                                       /* FTM1 Clock Gate Control */
    byte FTM2        :1;                                       /* FTM2 Clock Gate Control */
  } Bits;
  struct {
    byte grpCMPDAC_1 :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte grpFTM_1 :2;
  } MergedBits;
} SCGC1STR;
extern volatile SCGC1STR _SCGC1 @0x0000180E;
#define SCGC1                           _SCGC1.Byte
#define SCGC1_CMPDAC1                   _SCGC1.Bits.CMPDAC1
#define SCGC1_CMPDAC2                   _SCGC1.Bits.CMPDAC2
#define SCGC1_CMPDAC3                   _SCGC1.Bits.CMPDAC3
#define SCGC1_PDB                       _SCGC1.Bits.PDB
#define SCGC1_RTC                       _SCGC1.Bits.RTC
#define SCGC1_MTIM                      _SCGC1.Bits.MTIM
#define SCGC1_FTM1                      _SCGC1.Bits.FTM1
#define SCGC1_FTM2                      _SCGC1.Bits.FTM2
#define SCGC1_CMPDAC_1                  _SCGC1.MergedBits.grpCMPDAC_1
#define SCGC1_FTM_1                     _SCGC1.MergedBits.grpFTM_1
#define SCGC1_CMPDAC                    SCGC1_CMPDAC_1
#define SCGC1_FTM                       SCGC1_FTM_1

#define SCGC1_CMPDAC1_MASK              1U
#define SCGC1_CMPDAC2_MASK              2U
#define SCGC1_CMPDAC3_MASK              4U
#define SCGC1_PDB_MASK                  8U
#define SCGC1_RTC_MASK                  16U
#define SCGC1_MTIM_MASK                 32U
#define SCGC1_FTM1_MASK                 64U
#define SCGC1_FTM2_MASK                 128U
#define SCGC1_CMPDAC_1_MASK             7U
#define SCGC1_CMPDAC_1_BITNUM           0U
#define SCGC1_FTM_1_MASK                192U
#define SCGC1_FTM_1_BITNUM              6U


/*** SCGC2 - System Clock Gating Control 2 Register; 0x0000180F ***/
typedef union {
  byte Byte;
  struct {
    byte PGA         :1;                                       /* PGA Clock Gate Control */
    byte IIC         :1;                                       /* IIC Clock Gate Control */
    byte SPI         :1;                                       /* SPI Clock Gate Control */
    byte SCI         :1;                                       /* SCI Clock Gate Control */
    byte ADC         :1;                                       /* ADC Clock Gate Control */
    byte KBI         :1;                                       /* KBI1, KBI2, and KBI3 Clock Gate Control */
    byte FLS         :1;                                       /* Flash Clock Gate Control */
    byte DBG         :1;                                       /* DBG Clock Gate Control */
  } Bits;
} SCGC2STR;
extern volatile SCGC2STR _SCGC2 @0x0000180F;
#define SCGC2                           _SCGC2.Byte
#define SCGC2_PGA                       _SCGC2.Bits.PGA
#define SCGC2_IIC                       _SCGC2.Bits.IIC
#define SCGC2_SPI                       _SCGC2.Bits.SPI
#define SCGC2_SCI                       _SCGC2.Bits.SCI
#define SCGC2_ADC                       _SCGC2.Bits.ADC
#define SCGC2_KBI                       _SCGC2.Bits.KBI
#define SCGC2_FLS                       _SCGC2.Bits.FLS
#define SCGC2_DBG                       _SCGC2.Bits.DBG

#define SCGC2_PGA_MASK                  1U
#define SCGC2_IIC_MASK                  2U
#define SCGC2_SPI_MASK                  4U
#define SCGC2_SCI_MASK                  8U
#define SCGC2_ADC_MASK                  16U
#define SCGC2_KBI_MASK                  32U
#define SCGC2_FLS_MASK                  64U
#define SCGC2_DBG_MASK                  128U


/*** DBGCA - Debug Comparator A Register; 0x00001810 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** DBGCAH - Debug Comparator A High Register; 0x00001810 ***/
    union {
      byte Byte;
      struct {
        byte Bit8        :1;                                       /* Comparator A High Compare Bit 8 */
        byte Bit9        :1;                                       /* Comparator A High Compare Bit 9 */
        byte Bit10       :1;                                       /* Comparator A High Compare Bit 10 */
        byte Bit11       :1;                                       /* Comparator A High Compare Bit 11 */
        byte Bit12       :1;                                       /* Comparator A High Compare Bit 12 */
        byte Bit13       :1;                                       /* Comparator A High Compare Bit 13 */
        byte Bit14       :1;                                       /* Comparator A High Compare Bit 14 */
        byte Bit15       :1;                                       /* Comparator A High Compare Bit 15 */
      } Bits;
    } DBGCAHSTR;
    #define DBGCAH                      _DBGCA.Overlap_STR.DBGCAHSTR.Byte
    #define DBGCAH_Bit8                 _DBGCA.Overlap_STR.DBGCAHSTR.Bits.Bit8
    #define DBGCAH_Bit9                 _DBGCA.Overlap_STR.DBGCAHSTR.Bits.Bit9
    #define DBGCAH_Bit10                _DBGCA.Overlap_STR.DBGCAHSTR.Bits.Bit10
    #define DBGCAH_Bit11                _DBGCA.Overlap_STR.DBGCAHSTR.Bits.Bit11
    #define DBGCAH_Bit12                _DBGCA.Overlap_STR.DBGCAHSTR.Bits.Bit12
    #define DBGCAH_Bit13                _DBGCA.Overlap_STR.DBGCAHSTR.Bits.Bit13
    #define DBGCAH_Bit14                _DBGCA.Overlap_STR.DBGCAHSTR.Bits.Bit14
    #define DBGCAH_Bit15                _DBGCA.Overlap_STR.DBGCAHSTR.Bits.Bit15
    
