trv/CL_H100_FW/H100/Project_Headers/mc9s08mp16.h
#define HSCMP2CR1_EN_MASK               1U
#define HSCMP2CR1_OPE_MASK              2U
#define HSCMP2CR1_COS_MASK              4U
#define HSCMP2CR1_INV_MASK              8U
#define HSCMP2CR1_PMODE_MASK            16U
#define HSCMP2CR1_WE_MASK               64U
#define HSCMP2CR1_SE_MASK               128U


/*** HSCMP2FPR - HSCMP2 Filter Period Register; 0x0000186A ***/
typedef union {
  byte Byte;
  struct {
    byte FILT_PER0   :1;                                       /* Filter Period, bit 0 */
    byte FILT_PER1   :1;                                       /* Filter Period, bit 1 */
    byte FILT_PER2   :1;                                       /* Filter Period, bit 2 */
    byte FILT_PER3   :1;                                       /* Filter Period, bit 3 */
    byte FILT_PER4   :1;                                       /* Filter Period, bit 4 */
    byte FILT_PER5   :1;                                       /* Filter Period, bit 5 */
    byte FILT_PER6   :1;                                       /* Filter Period, bit 6 */
    byte FILT_PER7   :1;                                       /* Filter Period, bit 7 */
  } Bits;
} HSCMP2FPRSTR;
extern volatile HSCMP2FPRSTR _HSCMP2FPR @0x0000186A;
#define HSCMP2FPR                       _HSCMP2FPR.Byte
#define HSCMP2FPR_FILT_PER0             _HSCMP2FPR.Bits.FILT_PER0
#define HSCMP2FPR_FILT_PER1             _HSCMP2FPR.Bits.FILT_PER1
#define HSCMP2FPR_FILT_PER2             _HSCMP2FPR.Bits.FILT_PER2
#define HSCMP2FPR_FILT_PER3             _HSCMP2FPR.Bits.FILT_PER3
#define HSCMP2FPR_FILT_PER4             _HSCMP2FPR.Bits.FILT_PER4
#define HSCMP2FPR_FILT_PER5             _HSCMP2FPR.Bits.FILT_PER5
#define HSCMP2FPR_FILT_PER6             _HSCMP2FPR.Bits.FILT_PER6
#define HSCMP2FPR_FILT_PER7             _HSCMP2FPR.Bits.FILT_PER7

#define HSCMP2FPR_FILT_PER0_MASK        1U
#define HSCMP2FPR_FILT_PER1_MASK        2U
#define HSCMP2FPR_FILT_PER2_MASK        4U
#define HSCMP2FPR_FILT_PER3_MASK        8U
#define HSCMP2FPR_FILT_PER4_MASK        16U
#define HSCMP2FPR_FILT_PER5_MASK        32U
#define HSCMP2FPR_FILT_PER6_MASK        64U
#define HSCMP2FPR_FILT_PER7_MASK        128U


/*** HSCMP2SCR - HSCMP2 Status & Control Register; 0x0000186B ***/
typedef union {
  byte Byte;
  struct {
    byte COUT        :1;                                       /* Analog Comparator Output */
    byte CFF         :1;                                       /* Analog Comparator Flag Falling */
    byte CFR         :1;                                       /* Analog Comparator Flag Rising */
    byte IEF         :1;                                       /* Comparator Interrupt Enable Falling */
    byte IER         :1;                                       /* Comparator Interrupt Enable Rising */
    byte SMLEB       :1;                                       /* Stop Mode Edge / Level Interrupt Control */
    byte             :1; 
    byte             :1; 
  } Bits;
} HSCMP2SCRSTR;
extern volatile HSCMP2SCRSTR _HSCMP2SCR @0x0000186B;
#define HSCMP2SCR                       _HSCMP2SCR.Byte
#define HSCMP2SCR_COUT                  _HSCMP2SCR.Bits.COUT
#define HSCMP2SCR_CFF                   _HSCMP2SCR.Bits.CFF
#define HSCMP2SCR_CFR                   _HSCMP2SCR.Bits.CFR
#define HSCMP2SCR_IEF                   _HSCMP2SCR.Bits.IEF
#define HSCMP2SCR_IER                   _HSCMP2SCR.Bits.IER
#define HSCMP2SCR_SMLEB                 _HSCMP2SCR.Bits.SMLEB

#define HSCMP2SCR_COUT_MASK             1U
#define HSCMP2SCR_CFF_MASK              2U
#define HSCMP2SCR_CFR_MASK              4U
#define HSCMP2SCR_IEF_MASK              8U
#define HSCMP2SCR_IER_MASK              16U
#define HSCMP2SCR_SMLEB_MASK            32U


/*** HSCMP2PCR - Pin Control Register; 0x0000186C ***/
typedef union {
  byte Byte;
  struct {
    byte INMPE1      :1;                                       /* Minus Input Pin 1 Enable */
    byte INMPE2      :1;                                       /* Minus Input Pin 2 Enable */
    byte INMPE3      :1;                                       /* Minus Input Pin 3 Enable */
    byte INMPE4      :1;                                       /* Minus Input Pin 4 Enable */
    byte INPPE1      :1;                                       /* Positive Input Pin 1 Enable */
    byte INPPE2      :1;                                       /* Positive Input Pin 2 Enable */
    byte INPPE3      :1;                                       /* Positive Input Pin 3 Enable */
    byte INPPE4      :1;                                       /* Positive Input Pin 4 Enable */
  } Bits;
  struct {
    byte grpINMPE_1 :4;
    byte grpINPPE_1 :4;
  } MergedBits;
} HSCMP2PCRSTR;
extern volatile HSCMP2PCRSTR _HSCMP2PCR @0x0000186C;
#define HSCMP2PCR                       _HSCMP2PCR.Byte
#define HSCMP2PCR_INMPE1                _HSCMP2PCR.Bits.INMPE1
#define HSCMP2PCR_INMPE2                _HSCMP2PCR.Bits.INMPE2
#define HSCMP2PCR_INMPE3                _HSCMP2PCR.Bits.INMPE3
#define HSCMP2PCR_INMPE4                _HSCMP2PCR.Bits.INMPE4
#define HSCMP2PCR_INPPE1                _HSCMP2PCR.Bits.INPPE1
#define HSCMP2PCR_INPPE2                _HSCMP2PCR.Bits.INPPE2
#define HSCMP2PCR_INPPE3                _HSCMP2PCR.Bits.INPPE3
#define HSCMP2PCR_INPPE4                _HSCMP2PCR.Bits.INPPE4
#define HSCMP2PCR_INMPE_1               _HSCMP2PCR.MergedBits.grpINMPE_1
#define HSCMP2PCR_INPPE_1               _HSCMP2PCR.MergedBits.grpINPPE_1
#define HSCMP2PCR_INMPE                 HSCMP2PCR_INMPE_1
#define HSCMP2PCR_INPPE                 HSCMP2PCR_INPPE_1

#define HSCMP2PCR_INMPE1_MASK           1U
#define HSCMP2PCR_INMPE2_MASK           2U
#define HSCMP2PCR_INMPE3_MASK           4U
#define HSCMP2PCR_INMPE4_MASK           8U
#define HSCMP2PCR_INPPE1_MASK           16U
#define HSCMP2PCR_INPPE2_MASK           32U
#define HSCMP2PCR_INPPE3_MASK           64U
#define HSCMP2PCR_INPPE4_MASK           128U
#define HSCMP2PCR_INMPE_1_MASK          15U
#define HSCMP2PCR_INMPE_1_BITNUM        0U
#define HSCMP2PCR_INPPE_1_MASK          240U
#define HSCMP2PCR_INPPE_1_BITNUM        4U


