trv/CL_H100_FW/H100/Project_Headers/mc9s08mp16.h
/*** HSCMP3CR0 - HSCMP3 Control Register 0; 0x00001870 ***/
typedef union {
  byte Byte;
  struct {
    byte MMC0        :1;                                       /* Minus Input Mux Control, bit 0 */
    byte MMC1        :1;                                       /* Minus Input Mux Control, bit 1 */
    byte PMC0        :1;                                       /* Positive Input Mux Control, bit 0 */
    byte PMC1        :1;                                       /* Positive Input Mux Control, bit 1 */
    byte FILTER_CNT0 :1;                                       /* Filter Sample Count, bit 0 */
    byte FILTER_CNT1 :1;                                       /* Filter Sample Count, bit 1 */
    byte FILTER_CNT2 :1;                                       /* Filter Sample Count, bit 2 */
    byte             :1; 
  } Bits;
  struct {
    byte grpMMC  :2;
    byte grpPMC  :2;
    byte grpFILTER_CNT :3;
    byte         :1;
  } MergedBits;
} HSCMP3CR0STR;
extern volatile HSCMP3CR0STR _HSCMP3CR0 @0x00001870;
#define HSCMP3CR0                       _HSCMP3CR0.Byte
#define HSCMP3CR0_MMC0                  _HSCMP3CR0.Bits.MMC0
#define HSCMP3CR0_MMC1                  _HSCMP3CR0.Bits.MMC1
#define HSCMP3CR0_PMC0                  _HSCMP3CR0.Bits.PMC0
#define HSCMP3CR0_PMC1                  _HSCMP3CR0.Bits.PMC1
#define HSCMP3CR0_FILTER_CNT0           _HSCMP3CR0.Bits.FILTER_CNT0
#define HSCMP3CR0_FILTER_CNT1           _HSCMP3CR0.Bits.FILTER_CNT1
#define HSCMP3CR0_FILTER_CNT2           _HSCMP3CR0.Bits.FILTER_CNT2
/* HSCMP3CR_ARR: Access 2 HSCMP3CRx registers in an array */
#define HSCMP3CR_ARR                    ((volatile byte * __far) &HSCMP3CR0)
#define HSCMP3CR0_MMC                   _HSCMP3CR0.MergedBits.grpMMC
#define HSCMP3CR0_PMC                   _HSCMP3CR0.MergedBits.grpPMC
#define HSCMP3CR0_FILTER_CNT            _HSCMP3CR0.MergedBits.grpFILTER_CNT

#define HSCMP3CR0_MMC0_MASK             1U
#define HSCMP3CR0_MMC1_MASK             2U
#define HSCMP3CR0_PMC0_MASK             4U
#define HSCMP3CR0_PMC1_MASK             8U
#define HSCMP3CR0_FILTER_CNT0_MASK      16U
#define HSCMP3CR0_FILTER_CNT1_MASK      32U
#define HSCMP3CR0_FILTER_CNT2_MASK      64U
#define HSCMP3CR0_MMC_MASK              3U
#define HSCMP3CR0_MMC_BITNUM            0U
#define HSCMP3CR0_PMC_MASK              12U
#define HSCMP3CR0_PMC_BITNUM            2U
#define HSCMP3CR0_FILTER_CNT_MASK       112U
#define HSCMP3CR0_FILTER_CNT_BITNUM     4U


/*** HSCMP3CR1 - HSCMP3 Control Register 1; 0x00001871 ***/
typedef union {
  byte Byte;
  struct {
    byte EN          :1;                                       /* Comparator Module Enable */
    byte OPE         :1;                                       /* Comparator Output Pin Enable */
    byte COS         :1;                                       /* Comparator Output Select */
    byte INV         :1;                                       /* Comparator INVERT */
    byte PMODE       :1;                                       /* Power Mode Select */
    byte             :1; 
    byte WE          :1;                                       /* Windowing Enable */
    byte SE          :1;                                       /* Sample Enable */
  } Bits;
} HSCMP3CR1STR;
extern volatile HSCMP3CR1STR _HSCMP3CR1 @0x00001871;
#define HSCMP3CR1                       _HSCMP3CR1.Byte
#define HSCMP3CR1_EN                    _HSCMP3CR1.Bits.EN
#define HSCMP3CR1_OPE                   _HSCMP3CR1.Bits.OPE
#define HSCMP3CR1_COS                   _HSCMP3CR1.Bits.COS
#define HSCMP3CR1_INV                   _HSCMP3CR1.Bits.INV
#define HSCMP3CR1_PMODE                 _HSCMP3CR1.Bits.PMODE
#define HSCMP3CR1_WE                    _HSCMP3CR1.Bits.WE
#define HSCMP3CR1_SE                    _HSCMP3CR1.Bits.SE

#define HSCMP3CR1_EN_MASK               1U
#define HSCMP3CR1_OPE_MASK              2U
#define HSCMP3CR1_COS_MASK              4U
#define HSCMP3CR1_INV_MASK              8U
#define HSCMP3CR1_PMODE_MASK            16U
#define HSCMP3CR1_WE_MASK               64U
#define HSCMP3CR1_SE_MASK               128U


/*** HSCMP3FPR - HSCMP3 Filter Period Register; 0x00001872 ***/
typedef union {
  byte Byte;
  struct {
    byte FILT_PER0   :1;                                       /* Filter Period, bit 0 */
    byte FILT_PER1   :1;                                       /* Filter Period, bit 1 */
    byte FILT_PER2   :1;                                       /* Filter Period, bit 2 */
    byte FILT_PER3   :1;                                       /* Filter Period, bit 3 */
    byte FILT_PER4   :1;                                       /* Filter Period, bit 4 */
    byte FILT_PER5   :1;                                       /* Filter Period, bit 5 */
    byte FILT_PER6   :1;                                       /* Filter Period, bit 6 */
    byte FILT_PER7   :1;                                       /* Filter Period, bit 7 */
  } Bits;
} HSCMP3FPRSTR;
extern volatile HSCMP3FPRSTR _HSCMP3FPR @0x00001872;
#define HSCMP3FPR                       _HSCMP3FPR.Byte
#define HSCMP3FPR_FILT_PER0             _HSCMP3FPR.Bits.FILT_PER0
#define HSCMP3FPR_FILT_PER1             _HSCMP3FPR.Bits.FILT_PER1
#define HSCMP3FPR_FILT_PER2             _HSCMP3FPR.Bits.FILT_PER2
#define HSCMP3FPR_FILT_PER3             _HSCMP3FPR.Bits.FILT_PER3
#define HSCMP3FPR_FILT_PER4             _HSCMP3FPR.Bits.FILT_PER4
#define HSCMP3FPR_FILT_PER5             _HSCMP3FPR.Bits.FILT_PER5
#define HSCMP3FPR_FILT_PER6             _HSCMP3FPR.Bits.FILT_PER6
#define HSCMP3FPR_FILT_PER7             _HSCMP3FPR.Bits.FILT_PER7

#define HSCMP3FPR_FILT_PER0_MASK        1U
#define HSCMP3FPR_FILT_PER1_MASK        2U
#define HSCMP3FPR_FILT_PER2_MASK        4U
#define HSCMP3FPR_FILT_PER3_MASK        8U
#define HSCMP3FPR_FILT_PER4_MASK        16U
#define HSCMP3FPR_FILT_PER5_MASK        32U
#define HSCMP3FPR_FILT_PER6_MASK        64U
#define HSCMP3FPR_FILT_PER7_MASK        128U


/*** HSCMP3SCR - HSCMP3 Status & Control Register; 0x00001873 ***/
typedef union {
  byte Byte;
  struct {
    byte COUT        :1;                                       /* Analog Comparator Output */
    byte CFF         :1;                                       /* Analog Comparator Flag Falling */
    byte CFR         :1;                                       /* Analog Comparator Flag Rising */
    byte IEF         :1;                                       /* Comparator Interrupt Enable Falling */
    byte IER         :1;                                       /* Comparator Interrupt Enable Rising */
    byte SMLEB       :1;                                       /* Stop Mode Edge / Level Interrupt Control */
    byte             :1; 
    byte             :1; 
  } Bits;
} HSCMP3SCRSTR;
extern volatile HSCMP3SCRSTR _HSCMP3SCR @0x00001873;
#define HSCMP3SCR                       _HSCMP3SCR.Byte
#define HSCMP3SCR_COUT                  _HSCMP3SCR.Bits.COUT
#define HSCMP3SCR_CFF                   _HSCMP3SCR.Bits.CFF
#define HSCMP3SCR_CFR                   _HSCMP3SCR.Bits.CFR
#define HSCMP3SCR_IEF                   _HSCMP3SCR.Bits.IEF
#define HSCMP3SCR_IER                   _HSCMP3SCR.Bits.IER
#define HSCMP3SCR_SMLEB                 _HSCMP3SCR.Bits.SMLEB

#define HSCMP3SCR_COUT_MASK             1U
#define HSCMP3SCR_CFF_MASK              2U
#define HSCMP3SCR_CFR_MASK              4U
#define HSCMP3SCR_IEF_MASK              8U
#define HSCMP3SCR_IER_MASK              16U
#define HSCMP3SCR_SMLEB_MASK            32U


