trv/CL_H100_FW/H100/Project_Headers/mc9s08mp16.h
/*** HSCMP3PCR - Pin Control Register; 0x00001874 ***/
typedef union {
  byte Byte;
  struct {
    byte INMPE1      :1;                                       /* Minus Input Pin 1 Enable */
    byte INMPE2      :1;                                       /* Minus Input Pin 2 Enable */
    byte INMPE3      :1;                                       /* Minus Input Pin 3 Enable */
    byte INMPE4      :1;                                       /* Minus Input Pin 4 Enable */
    byte INPPE1      :1;                                       /* Positive Input Pin 1 Enable */
    byte INPPE2      :1;                                       /* Positive Input Pin 2 Enable */
    byte INPPE3      :1;                                       /* Positive Input Pin 3 Enable */
    byte INPPE4      :1;                                       /* Positive Input Pin 4 Enable */
  } Bits;
  struct {
    byte grpINMPE_1 :4;
    byte grpINPPE_1 :4;
  } MergedBits;
} HSCMP3PCRSTR;
extern volatile HSCMP3PCRSTR _HSCMP3PCR @0x00001874;
#define HSCMP3PCR                       _HSCMP3PCR.Byte
#define HSCMP3PCR_INMPE1                _HSCMP3PCR.Bits.INMPE1
#define HSCMP3PCR_INMPE2                _HSCMP3PCR.Bits.INMPE2
#define HSCMP3PCR_INMPE3                _HSCMP3PCR.Bits.INMPE3
#define HSCMP3PCR_INMPE4                _HSCMP3PCR.Bits.INMPE4
#define HSCMP3PCR_INPPE1                _HSCMP3PCR.Bits.INPPE1
#define HSCMP3PCR_INPPE2                _HSCMP3PCR.Bits.INPPE2
#define HSCMP3PCR_INPPE3                _HSCMP3PCR.Bits.INPPE3
#define HSCMP3PCR_INPPE4                _HSCMP3PCR.Bits.INPPE4
#define HSCMP3PCR_INMPE_1               _HSCMP3PCR.MergedBits.grpINMPE_1
#define HSCMP3PCR_INPPE_1               _HSCMP3PCR.MergedBits.grpINPPE_1
#define HSCMP3PCR_INMPE                 HSCMP3PCR_INMPE_1
#define HSCMP3PCR_INPPE                 HSCMP3PCR_INPPE_1

#define HSCMP3PCR_INMPE1_MASK           1U
#define HSCMP3PCR_INMPE2_MASK           2U
#define HSCMP3PCR_INMPE3_MASK           4U
#define HSCMP3PCR_INMPE4_MASK           8U
#define HSCMP3PCR_INPPE1_MASK           16U
#define HSCMP3PCR_INPPE2_MASK           32U
#define HSCMP3PCR_INPPE3_MASK           64U
#define HSCMP3PCR_INPPE4_MASK           128U
#define HSCMP3PCR_INMPE_1_MASK          15U
#define HSCMP3PCR_INMPE_1_BITNUM        0U
#define HSCMP3PCR_INPPE_1_MASK          240U
#define HSCMP3PCR_INPPE_1_BITNUM        4U


/*** PGACNTL0 - PGA Control Register 0; 0x00001878 ***/
typedef union {
  byte Byte;
  struct {
    byte EN          :1;                                       /* Module Enable */
    byte LP          :1;                                       /* Power Mode */
    byte GAINSEL0    :1;                                       /* Gain Select, bit 0 */
    byte GAINSEL1    :1;                                       /* Gain Select, bit 1 */
    byte GAINSEL2    :1;                                       /* Gain Select, bit 2 */
    byte GAINSEL3    :1;                                       /* Gain Select, bit 3 */
    byte GAINSEL4    :1;                                       /* Gain Select, bit 4 */
    byte TM          :1;                                       /* Trigger Mode */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpGAINSEL :5;
    byte         :1;
  } MergedBits;
} PGACNTL0STR;
extern volatile PGACNTL0STR _PGACNTL0 @0x00001878;
#define PGACNTL0                        _PGACNTL0.Byte
#define PGACNTL0_EN                     _PGACNTL0.Bits.EN
#define PGACNTL0_LP                     _PGACNTL0.Bits.LP
#define PGACNTL0_GAINSEL0               _PGACNTL0.Bits.GAINSEL0
#define PGACNTL0_GAINSEL1               _PGACNTL0.Bits.GAINSEL1
#define PGACNTL0_GAINSEL2               _PGACNTL0.Bits.GAINSEL2
#define PGACNTL0_GAINSEL3               _PGACNTL0.Bits.GAINSEL3
#define PGACNTL0_GAINSEL4               _PGACNTL0.Bits.GAINSEL4
#define PGACNTL0_TM                     _PGACNTL0.Bits.TM
/* PGACNTL_ARR: Access 3 PGACNTLx registers in an array */
#define PGACNTL_ARR                     ((volatile byte * __far) &PGACNTL0)
#define PGACNTL0_GAINSEL                _PGACNTL0.MergedBits.grpGAINSEL

#define PGACNTL0_EN_MASK                1U
#define PGACNTL0_LP_MASK                2U
#define PGACNTL0_GAINSEL0_MASK          4U
#define PGACNTL0_GAINSEL1_MASK          8U
#define PGACNTL0_GAINSEL2_MASK          16U
#define PGACNTL0_GAINSEL3_MASK          32U
#define PGACNTL0_GAINSEL4_MASK          64U
#define PGACNTL0_TM_MASK                128U
#define PGACNTL0_GAINSEL_MASK           124U
#define PGACNTL0_GAINSEL_BITNUM         2U


/*** PGACNTL1 - PGA Control Register 1; 0x00001879 ***/
typedef union {
  byte Byte;
  struct {
    byte CPD0        :1;                                       /* Charge Pump Divisor, bit 0 */
    byte CPD1        :1;                                       /* Charge Pump Divisor, bit 1 */
    byte CPD2        :1;                                       /* Charge Pump Divisor, bit 2 */
    byte CALMODE0    :1;                                       /* Calibration Mode, bit 0 */
    byte CALMODE1    :1;                                       /* Calibration Mode, bit 1 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpCPD  :3;
    byte grpCALMODE :2;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PGACNTL1STR;
extern volatile PGACNTL1STR _PGACNTL1 @0x00001879;
#define PGACNTL1                        _PGACNTL1.Byte
#define PGACNTL1_CPD0                   _PGACNTL1.Bits.CPD0
#define PGACNTL1_CPD1                   _PGACNTL1.Bits.CPD1
#define PGACNTL1_CPD2                   _PGACNTL1.Bits.CPD2
#define PGACNTL1_CALMODE0               _PGACNTL1.Bits.CALMODE0
#define PGACNTL1_CALMODE1               _PGACNTL1.Bits.CALMODE1
#define PGACNTL1_CPD                    _PGACNTL1.MergedBits.grpCPD
#define PGACNTL1_CALMODE                _PGACNTL1.MergedBits.grpCALMODE

#define PGACNTL1_CPD0_MASK              1U
#define PGACNTL1_CPD1_MASK              2U
#define PGACNTL1_CPD2_MASK              4U
#define PGACNTL1_CALMODE0_MASK          8U
#define PGACNTL1_CALMODE1_MASK          16U
#define PGACNTL1_CPD_MASK               7U
#define PGACNTL1_CPD_BITNUM             0U
#define PGACNTL1_CALMODE_MASK           24U
#define PGACNTL1_CALMODE_BITNUM         3U


/*** PGACNTL2 - PGA Control Register 2; 0x0000187A ***/
typedef union {
  byte Byte;
  struct {
    byte ADIV0       :1;                                       /* Clock Divide Select, bit 0 */
    byte ADIV1       :1;                                       /* Clock Divide Select, bit 1 */
    byte NUM_CLK_GS0 :1;                                       /* Number of clk_gs pulses per conversion, bit 0 */
    byte NUM_CLK_GS1 :1;                                       /* Number of clk_gs pulses per conversion, bit 1 */
    byte NUM_CLK_GS2 :1;                                       /* Number of clk_gs pulses per conversion, bit 2 */
    byte SWTRIG      :1;                                       /* Software Trigger */
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpADIV :2;
    byte grpNUM_CLK_GS :3;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PGACNTL2STR;
extern volatile PGACNTL2STR _PGACNTL2 @0x0000187A;
#define PGACNTL2                        _PGACNTL2.Byte
#define PGACNTL2_ADIV0                  _PGACNTL2.Bits.ADIV0
#define PGACNTL2_ADIV1                  _PGACNTL2.Bits.ADIV1
#define PGACNTL2_NUM_CLK_GS0            _PGACNTL2.Bits.NUM_CLK_GS0
#define PGACNTL2_NUM_CLK_GS1            _PGACNTL2.Bits.NUM_CLK_GS1
#define PGACNTL2_NUM_CLK_GS2            _PGACNTL2.Bits.NUM_CLK_GS2
#define PGACNTL2_SWTRIG                 _PGACNTL2.Bits.SWTRIG
#define PGACNTL2_ADIV                   _PGACNTL2.MergedBits.grpADIV
#define PGACNTL2_NUM_CLK_GS             _PGACNTL2.MergedBits.grpNUM_CLK_GS

#define PGACNTL2_ADIV0_MASK             1U
#define PGACNTL2_ADIV1_MASK             2U
#define PGACNTL2_NUM_CLK_GS0_MASK       4U
#define PGACNTL2_NUM_CLK_GS1_MASK       8U
#define PGACNTL2_NUM_CLK_GS2_MASK       16U
#define PGACNTL2_SWTRIG_MASK            32U
#define PGACNTL2_ADIV_MASK              3U
#define PGACNTL2_ADIV_BITNUM            0U
#define PGACNTL2_NUM_CLK_GS_MASK        28U
#define PGACNTL2_NUM_CLK_GS_BITNUM      2U


